'use strict';
/**
 * Dataset Armors
 *
 * @package     MHW Calculator
 * @author      Scar Wu
 * @copyright   Copyright (c) Scar Wu (http://scar.tw)
 * @link        https://github.com/scarwu/MHWCalculator
 */

export default [
    [
        [ '火龍魂α', 7, 'general', 82, [ 3, 2, 2, -3, -4 ], '火龍奧秘' ],
        [
            [ '火龍魂頭盔α', 'helm', null, [ [ '超會心', 1 ], [ '威嚇', 2 ] ] ],
            [ '火龍魂鎧甲α', 'chest', [ 1 ], [ [ '屬性解放／裝填擴充', 1 ], [ '威嚇', 1 ] ] ],
            [ '火龍魂腕甲α', 'arm', [ 1 ], [ [ '集中', 1 ], [ '風壓耐性', 1 ] ] ],
            [ '火龍魂腰甲α', 'waist', null, [ [ '風壓耐性', 2 ], [ '貫通彈・龍之箭強化', 1 ] ] ],
            [ '火龍魂護腿α', 'leg', null, [ [ '集中', 1 ], [ '攀岩者', 1 ] ] ]
        ]
    ],
    [
        [ '火龍魂β', 7, 'general', 82, [ 3, 2, 3, -3, -4 ], '火龍奧秘' ],
        [
            [ '火龍魂頭盔β', 'helm', [ 1, 1 ], [ [ '超會心', 1 ] ] ],
            [ '火龍魂鎧甲β', 'chest', [ 2 ], [ [ '屬性解放／裝填擴充', 1 ] ] ],
            [ '火龍魂腕甲β', 'arm', [ 2 ], [ [ '集中', 1 ] ] ],
            [ '火龍魂腰甲β', 'waist', [ 3 ], [ [ '風壓耐性', 2 ] ] ],
            [ '火龍魂護腿β', 'leg', [ 1 ], [ [ '集中', 1 ] ] ]
        ]
    ],
    [
        [ '骷髏α', 7, 'general', 90, [ -3, -1, -1, -1, 2 ], null ],
        [
            [ '骷髏面罩α', 'helm', [ 2 ], [ [ '匠', 1 ] ] ]
        ]
    ],
    [
        [ '杜賓α', 7, 'general', 86, [ -2, 0, -1, -1, 4 ], null ],
        [
            [ '杜賓頭盔α', 'helm', null, [ [ '屬性解放／裝填擴充', 1 ], [ '龍耐性', 1 ] ] ],
            [ '杜賓鎧甲α', 'chest', [ 1 ], [ [ '攻擊', 2 ], [ '最愛菇類', 1 ] ] ],
            [ '杜賓腕甲α', 'arm', null, [ [ '耐力急速回復', 2 ], [ '最愛菇類', 1 ] ] ],
            [ '杜賓腰甲α', 'waist', [ 2 ], [ [ '龍耐性', 2 ], [ '攻擊', 1 ] ] ],
            [ '杜賓護腿α', 'leg', null, [ [ '攻擊', 2 ], [ '耐力急速回復', 1 ] ] ]
        ]
    ],
    [
        [ '杜賓β', 7, 'general', 86, [ -2, 0, -1, -1, 4 ], null ],
        [
            [ '杜賓頭盔β', 'helm', [ 1 ], [ [ '屬性解放／裝填擴充', 1 ] ] ],
            [ '杜賓鎧甲β', 'chest', [ 3 ], [ [ '攻擊', 2 ] ] ],
            [ '杜賓腕甲β', 'arm', [ 1, 1 ], [ [ '耐力急速回復', 1 ], [ '最愛菇類', 1 ] ] ],
            [ '杜賓腰甲β', 'waist', [ 3 ], [ [ '龍耐性', 2 ] ] ],
            [ '杜賓護腿β', 'leg', [ 1 ], [ [ '攻擊', 2 ] ] ]
        ]
    ],
    [
        [ '爆鎚龍α', 7, 'general', 86, [ 4, -3, 1, -2, -2 ], '爆鎚龍的守護' ],
        [
            [ '爆鎚龍頭盔α', 'helm', [ 3 ], [ [ '雷耐性', 2 ] ] ],
            [ '爆鎚龍鎧甲α', 'chest', [ 1 ], [ [ '破壞王', 2 ] ] ],
            [ '爆鎚龍腕甲α', 'arm', [ 1 ], [ [ '防禦性能', 1 ], [ '防禦', 1 ] ] ],
            [ '爆鎚龍腰甲α', 'waist', [ 1, 1 ], [ [ '破壞王', 1 ], [ '雷耐性', 1 ] ] ],
            [ '爆鎚龍護腿α', 'leg', [ 1 ], [ [ '防禦性能', 2 ] ] ]
        ]
    ],
    [
        [ '爆鎚龍β', 7, 'general', 86, [ 4, -3, 1, -2, -2 ], '爆鎚龍的守護' ],
        [
            [ '爆鎚龍頭盔β', 'helm', [ 3, 1 ], [ [ '雷耐性', 1 ] ] ],
            [ '爆鎚龍鎧甲β', 'chest', [ 3 ], [ [ '破壞王', 1 ] ] ],
            [ '爆鎚龍腕甲β', 'arm', [ 2 ], [ [ '防禦性能', 1 ] ] ],
            [ '爆鎚龍腰甲β', 'waist', [ 2, 1 ], [ [ '破壞王', 1 ] ] ],
            [ '爆鎚龍護腿β', 'leg', [ 3 ], [ [ '防禦性能', 1 ] ] ]
        ]
    ],
    [
        [ '大馬士革α', 7, 'general', 86, [ 4, -2, 0, 0, 0 ], null ],
        [
            [ '大馬士革頭盔α', 'helm', [ 1 ], [ [ '防禦', 2 ], [ '砥石使用高速化', 1 ] ] ],
            [ '大馬士革鎧甲α', 'chest', [ 1 ], [ [ '集中', 2 ], [ '防禦', 2 ] ] ],
            [ '大馬士革腕甲α', 'arm', null, [ [ '匠', 1 ], [ '砥石使用高速化', 1 ] ] ],
            [ '大馬士革腰甲α', 'waist', [ 1 ], [ [ '集中', 1 ], [ '防御力DOWN耐性', 2 ] ] ],
            [ '大馬士革護腿α', 'leg', [ 1 ], [ [ '防禦', 2 ], [ '防御力DOWN耐性', 1 ] ] ]
        ]
    ],
    [
        [ '大馬士革β', 7, 'general', 86, [ 4, -2, 0, 0, 0 ], null ],
        [
            [ '大馬士革頭盔β', 'helm', [ 3 ], [ [ '防禦', 2 ] ] ],
            [ '大馬士革鎧甲β', 'chest', [ 1, 1, 1 ], [ [ '集中', 2 ] ] ],
            [ '大馬士革腕甲β', 'arm', [ 1 ], [ [ '匠', 1 ] ] ],
            [ '大馬士革腰甲β', 'waist', [ 1, 1, 1 ], [ [ '集中', 1 ] ] ],
            [ '大馬士革護腿β', 'leg', [ 3 ], [ [ '防禦', 2 ] ] ]
        ]
    ],
    [
        [ '暴君角龍α', 7, 'general', 82, [ 2, -3, 0, -4, 2 ], '角龍之奧秘' ],
        [
            [ '暴君角龍頭盔α', 'helm', [ 1 ], [ [ '集中', 2 ] ] ],
            [ '暴君角龍鎧甲α', 'chest', [ 1 ], [ [ '怨恨', 2 ] ] ],
            [ '暴君角龍腕甲α', 'arm', null, [ [ '集中', 1 ], [ '跑者', 1 ] ] ],
            [ '暴君角龍腰甲α', 'waist', null, [ [ '怨恨', 1 ], [ '破壞王', 1 ] ] ],
            [ '暴君角龍護腿α', 'leg', [ 1 ], [ [ '通常彈・通常箭強化', 1 ], [ '火場怪力', 1 ] ] ]
        ]
    ],
    [
        [ '暴君角龍β', 7, 'general', 82, [ 2, -3, 0, -4, 2 ], '角龍之奧秘' ],
        [
            [ '暴君角龍頭盔β', 'helm', [ 3 ], [ [ '集中', 1 ] ] ],
            [ '暴君角龍鎧甲β', 'chest', [ 2, 1 ], [ [ '怨恨', 1 ] ] ],
            [ '暴君角龍腕甲β', 'arm', [ 2, 1 ], [ [ '集中', 1 ] ] ],
            [ '暴君角龍腰甲β', 'waist', [ 2 ], [ [ '怨恨', 1 ] ] ],
            [ '暴君角龍護腿β', 'leg', [ 2 ], [ [ '通常彈・通常箭強化', 1 ] ] ]
        ]
    ],
    [
        [ '死神α', 7, 'general', 88, [ 3, 2, -2, 3, -4 ], null ],
        [
            [ '死神頭盔α', 'helm', [ 2 ], [ [ '死裡逃生', 1 ], [ '看破', 1 ] ] ],
            [ '死神鎧甲α', 'chest', null, [ [ '不屈', 1 ], [ '屬性解放／裝填擴充', 1 ] ] ],
            [ '死神腕甲α', 'arm', [ 1 ], [ [ '集中', 2 ], [ '龍屬性攻擊強化', 1 ] ] ],
            [ '死神腰甲α', 'waist', null, [ [ '龍屬性攻擊強化', 2 ], [ '集中', 1 ] ] ],
            [ '死神護腿α', 'leg', null, [ [ '匠', 2 ], [ '龍屬性攻擊強化', 2 ] ] ]
        ]
    ],
    [
        [ '死神β', 7, 'general', 88, [ 3, 2, -2, 3, -4 ], null ],
        [
            [ '死神頭盔β', 'helm', [ 3 ], [ [ '死裡逃生', 1 ] ] ],
            [ '死神鎧甲β', 'chest', [ 3 ], [ [ '不屈', 1 ] ] ],
            [ '死神腕甲β', 'arm', [ 1, 1 ], [ [ '集中', 2 ] ] ],
            [ '死神腰甲β', 'waist', [ 1, 1 ], [ [ '龍屬性攻擊強化', 2 ] ] ],
            [ '死神護腿β', 'leg', [ 1, 1 ], [ [ '匠', 2 ] ] ]
        ]
    ],
    [
        [ '爆鱗龍α', 7, 'general', 84, [ 3, 1, -4, -2, -2 ], '爆鱗龍的守護' ],
        [
            [ '爆鱗龍頭盔α', 'helm', [ 2 ], [ [ '耳塞', 2 ], [ '爆破屬性強化', 1 ] ] ],
            [ '爆鱗龍鎧甲α', 'chest', null, [ [ '防禦性能', 2 ], [ '爆破異常狀態的耐性', 2 ] ] ],
            [ '爆鱗龍腕甲α', 'arm', null, [ [ '拔刀術【技】', 2 ], [ '耳塞', 1 ] ] ],
            [ '爆鱗龍腰甲α', 'waist', [ 1 ], [ [ '耳塞', 2 ], [ '跳躍鐵人', 1 ] ] ],
            [ '爆鱗龍護腿α', 'leg', [ 1 ], [ [ '炸彈客', 2 ], [ '拔刀術【技】', 1 ] ] ]
        ]
    ],
    [
        [ '爆鱗龍β', 7, 'general', 84, [ 3, 1, -4, -2, -2 ], '爆鱗龍的守護' ],
        [
            [ '爆鱗龍頭盔β', 'helm', [ 3, 1 ], [ [ '耳塞', 2 ] ] ],
            [ '爆鱗龍鎧甲β', 'chest', [ 1, 1 ], [ [ '防禦性能', 2 ] ] ],
            [ '爆鱗龍腕甲β', 'arm', [ 3 ], [ [ '拔刀術【技】', 2 ] ] ],
            [ '爆鱗龍腰甲β', 'waist', [ 3 ], [ [ '耳塞', 2 ] ] ],
            [ '爆鱗龍護腿β', 'leg', [ 3 ], [ [ '炸彈客', 2 ] ] ]
        ]
    ],
    [
        [ '龍封的耳環α', 7, 'general', 86, [ 3, 2, 0, 2, 0 ], null ],
        [
            [ '龍封的耳環α', 'helm', [ 2, 1 ], [ [ '龍封力強化', 1 ] ] ]
        ]
    ],
    [
        [ '殘虐α', 7, 'general', 84, [ 1, 1, -3, 2, -3 ], null ],
        [
            [ '殘虐頭盔α', 'helm', [ 1 ], [ [ '破壞王', 1 ], [ '匠', 1 ] ] ],
            [ '殘虐鎧甲α', 'chest', [ 2 ], [ [ '快吃', 1 ], [ '匠', 1 ] ] ],
            [ '殘虐腕甲α', 'arm', null, [ [ '力量解放', 2 ], [ '破壞王', 1 ] ] ],
            [ '殘虐腰甲α', 'waist', [ 1 ], [ [ '力量解放', 1 ], [ '匠', 1 ] ] ],
            [ '殘虐護腿α', 'leg', null, [ [ '快吃', 2 ], [ '破壞王', 1 ] ] ]
        ]
    ],
    [
        [ '殘虐β', 7, 'general', 84, [ 1, 1, -3, 2, -3 ], null ],
        [
            [ '殘虐頭盔β', 'helm', [ 3, 1 ], [ [ '破壞王', 1 ] ] ],
            [ '殘虐鎧甲β', 'chest', [ 3 ], [ [ '快吃', 1 ] ] ],
            [ '殘虐腕甲β', 'arm', [ 2 ], [ [ '力量解放', 2 ] ] ],
            [ '殘虐腰甲β', 'waist', [ 3, 1 ], [ [ '力量解放', 1 ] ] ],
            [ '殘虐護腿β', 'leg', [ 1, 1 ], [ [ '快吃', 2 ] ] ]
        ]
    ],
    [
        [ '蒼星α', 7, 'general', 82, [ 2, 2, 0, 0, 3 ], '火龍奧秘' ],
        [
            [ '蒼星之將【頭盔】α', 'helm', [ 3 ], [ [ '挑戰者', 1 ] ] ],
            [ '蒼星之將【鎧甲】α', 'chest', [ 2 ], [ [ '匠', 1 ] ] ],
            [ '蒼星之將【腕甲】α', 'arm', [ 3 ], [ [ '體力回復量UP', 2 ] ] ],
            [ '蒼星之將【腰帶】α', 'waist', [ 2 ], [ [ '匠', 1 ] ] ],
            [ '蒼星之將【腿甲】α', 'leg', [ 3 ], [ [ '超會心', 1 ] ] ]
        ]
    ]
];
