'use strict';
/**
 * Dataset Armors
 *
 * @package     MHW Calculator
 * @author      Scar Wu
 * @copyright   Copyright (c) Scar Wu (http://scar.tw)
 * @link        https://github.com/scarwu/MHWCalculator
 */

let combine = (common, list) => {
    return list.map((item) => {
        return {
            series: common[0],
            rare: common[1],
            gender: common[2],
            defense: common[3],
            resistance: common[4],
            set: (null !== common[5]) ? {
                name: common[5]
            } : null,
            name: item[0],
            type: item[1],
            slots: (null !== item[2]) ? item[2].map((size) => {
                return {
                    size: size
                }
            }) : null,
            skills: (null !== item[3]) ? item[3].map((skill) => {
                return {
                    name: skill[0],
                    level: skill[1]
                };
            }) : null
        };
    });
};

let armors = [];

armors = armors.concat(combine(
    [ '烏爾德α', 8, 'general', 84, [ -4, 4, 1, -1, -3 ], '屍套龍的命脈' ],
    [
        [ '烏爾德頭盔α', 'helm', null, [ [ '無傷', 1 ], [ '龍屬性攻擊強化', 2 ] ] ],
        [ '烏爾德鎧甲α', 'chest', [ 1 ], [ [ '回復速度', 2 ], [ '龍屬性攻擊強化', 1 ] ] ],
        [ '烏爾德腕甲α', 'arm', [ 1 ], [ [ '無傷', 1 ], [ '回復速度', 1 ] ] ],
        [ '烏爾德腰甲α', 'waist', [ 1 ], [ [ '無傷', 1 ], [ '瘴氣耐性', 1 ] ] ],
        [ '烏爾德護腿α', 'leg', [ 1 ], [ [ '瘴氣耐性', 2 ], [ '龍屬性攻擊強化', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '烏爾德β', 8, 'general', 84, [ -4, 4, 1, -1, -3 ], '屍套龍的命脈' ],
    [
        [ '烏爾德頭盔β', 'helm', [ 1 ], [ [ '無傷', 1 ] ] ],
        [ '烏爾德鎧甲β', 'chest', [ 1, 1 ], [ [ '回復速度', 2 ] ] ],
        [ '烏爾德腕甲β', 'arm', [ 1, 1, 1 ], [ [ '無傷', 1 ] ] ],
        [ '烏爾德腰甲β', 'waist', [ 1, 1 ], [ [ '無傷', 1 ] ] ],
        [ '烏爾德護腿β', 'leg', [ 1, 1 ], [ [ '瘴氣耐性', 2 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '戰紋α', 8, 'general', 84, [ 1, 1, -3, 1, -3 ], '滅盡龍的飢餓' ],
    [
        [ '戰紋頭盔α', 'helm', [ 1 ], [ [ '精神抖擻', 2 ], [ '攻擊', 1 ] ] ],
        [ '戰紋鎧甲α', 'chest', [ 1 ], [ [ '耐力急速回復', 2 ], [ '挑戰者', 1 ] ] ],
        [ '戰紋腕甲α', 'arm', null, [ [ '挑戰者', 2 ], [ '攻擊', 1 ] ] ],
        [ '戰紋腰甲α', 'waist', null, [ [ '攻擊', 2 ], [ '耐力急速回復', 1 ] ] ],
        [ '戰紋護腿α', 'leg', [ 1 ], [ [ '精神抖擻', 1 ], [ '挑戰者', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '戰紋β', 8, 'general', 84, [ 1, 1, -3, 1, -3 ], '滅盡龍的飢餓' ],
    [
        [ '戰紋頭盔β', 'helm', [ 1, 1 ], [ [ '精神抖擻', 2 ] ] ],
        [ '戰紋鎧甲β', 'chest', [ 2, 1 ], [ [ '耐力急速回復', 2 ] ] ],
        [ '戰紋腕甲β', 'arm', [ 1 ], [ [ '挑戰者', 2 ] ] ],
        [ '戰紋腰甲β', 'waist', [ 2 ], [ [ '攻擊', 2 ] ] ],
        [ '戰紋護腿β', 'leg', [ 2 ], [ [ '精神抖擻', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '帝王α', 8, 'general', 84, [ 3, -3, 1, -3, 1 ], '炎王龍的武技' ],
    [
        [ '帝王皇冠α', 'helm', null, [ [ '力量解放', 2 ] ] ],
        [ '帝王鎧甲α', 'chest', null, [ [ '特殊射擊強化', 2 ], [ '力量解放', 1 ] ] ],
        [ '帝王腕甲α', 'arm', [ 1 ], [ [ '弱點特效', 2 ] ] ],
        [ '帝王腰甲α', 'waist', null, [ [ '爆破屬性強化', 2 ], [ '弱點特效', 1 ] ] ],
        [ '帝王護腿α', 'leg', null, [ [ '力量解放', 2 ], [ '爆破屬性強化', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '帝王β', 8, 'general', 84, [ 3, -3, 1, -3, 1 ], '炎王龍的武技' ],
    [
        [ '帝王皇冠β', 'helm', [ 2 ], [ [ '力量解放', 1 ] ] ],
        [ '帝王鎧甲β', 'chest', [ 1, 1 ], [ [ '特殊射擊強化', 2 ] ] ],
        [ '帝王腕甲β', 'arm', [ 3 ], [ [ '弱點特效', 1 ] ] ],
        [ '帝王腰甲β', 'waist', [ 2 ], [ [ '爆破屬性強化', 2 ] ] ],
        [ '帝王護腿β', 'leg', [ 1 ], [ [ '力量解放', 2 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '鋼龍α', 8, 'general', 84, [ 0, 2, -3, 4, -2 ], '鋼龍的飛翅' ],
    [
        [ '鋼龍強力α', 'helm', null, [ [ '冰屬性攻擊強化', 2 ], [ '匠', 1 ] ] ],
        [ '鋼龍恐懼α', 'chest', null, [ [ '匠', 2 ], [ '集中', 1 ] ] ],
        [ '鋼龍剛強α', 'arm', null, [ [ '迴避性能', 2 ], [ '匠', 1 ] ] ],
        [ '鋼龍安穩α', 'waist', null, [ [ '冰屬性攻擊強化', 2 ], [ '迴避距離UP', 1 ] ] ],
        [ '鋼龍踏實α', 'leg', null, [ [ '迴避距離UP', 2 ], [ '匠', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '鋼龍β', 8, 'general', 84, [ 0, 2, -3, 4, -2 ], '鋼龍的飛翅' ],
    [
        [ '鋼龍強力β', 'helm', [ 1, 1, 1 ], [ [ '冰屬性攻擊強化', 2 ] ] ],
        [ '鋼龍恐懼β', 'chest', [ 2 ], [ [ '匠', 2 ] ] ],
        [ '鋼龍剛強β', 'arm', [ 3 ], [ [ '迴避性能', 2 ] ] ],
        [ '鋼龍安穩β', 'waist', [ 1, 1 ], [ [ '冰屬性攻擊強化', 2 ] ] ],
        [ '鋼龍踏實β', 'leg', [ 3 ], [ [ '迴避距離UP', 2 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '龍王的獨眼α', 8, 'general', 90, [ 0, 0, 0, 0, 0 ], null ],
    [
        [ '龍王的獨眼α', 'helm', [ 3 ], [ [ '弱點特效', 2 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '冥燈龍α', 8, 'general', 92, [ -3, 2, 2, 2, -4 ], '冥燈龍的神秘' ],
    [
        [ '異種大型頭飾α', 'helm', [ 1 ], [ [ '減輕膽怯', 1 ], [ '特殊射擊強化', 1 ] ] ],
        [ '異種大型皮α', 'chest', [ 1 ], [ [ '強化持續', 2 ], [ '屬性異常狀態耐性', 1 ] ] ],
        [ '異種大型鋼爪α', 'arm', [ 1 ], [ [ '減輕膽怯', 1 ], [ '超會心', 1 ] ] ],
        [ '異種大型脊椎α', 'waist', [ 2 ], [ [ '屬性異常狀態耐性', 2 ], [ '特殊射擊強化', 1 ] ] ],
        [ '異種大型靴α', 'leg', [ 1 ], [ [ '減輕膽怯', 1 ], [ '強化持續', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '冥燈龍β', 8, 'general', 92, [ -3, 2, 2, 2, -4 ], '冥燈龍的神秘' ],
    [
        [ '異種大型頭飾β', 'helm', [ 2 ], [ [ '減輕膽怯', 1 ] ] ],
        [ '異種大型皮β', 'chest', [ 1, 1 ], [ [ '強化持續', 2 ] ] ],
        [ '異種大型鋼爪β', 'arm', [ 3 ], [ [ '減輕膽怯', 1 ] ] ],
        [ '異種大型脊椎β', 'waist', [ 2, 1 ], [ [ '屬性異常狀態耐性', 2 ] ] ],
        [ '異種大型靴β', 'leg', [ 1, 1 ], [ [ '減輕膽怯', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '麒麟α', 8, 'general', 84, [ -3, -2, 4, -2, 2 ], '麒麟的恩寵' ],
    [
        [ '麒麟角α', 'helm', null, [ [ '跑者', 2 ], [ '精靈加護', 1 ] ] ],
        [ '麒麟服飾α', 'chest', null, [ [ '精靈加護', 2 ], [ '雷屬性攻擊強化', 1 ] ] ],
        [ '麒麟長腕甲α', 'arm', null, [ [ '雷屬性攻擊強化', 2 ], [ '跑者', 1 ] ] ],
        [ '麒麟腰環α', 'waist', null, [ [ '屬性異常狀態耐性', 1 ], [ '屬性解放／裝填擴充', 1 ] ] ],
        [ '麒麟護脛α', 'leg', null, [ [ '屬性解放／裝填擴充', 2 ], [ '雷耐性', 2 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '麒麟β', 8, 'general', 84, [ -3, -2, 4, -2, 2 ], '麒麟的恩寵' ],
    [
        [ '麒麟角β', 'helm', [ 1 ], [ [ '跑者', 2 ] ] ],
        [ '麒麟服飾β', 'chest', [ 1 ], [ [ '精靈加護', 2 ] ] ],
        [ '麒麟長腕甲β', 'arm', [ 1, 1 ], [ [ '雷屬性攻擊強化', 2 ] ] ],
        [ '麒麟腰環β', 'waist', [ 1, 1, 1 ], [ [ '屬性異常狀態耐性', 1 ] ] ],
        [ '麒麟護脛β', 'leg', [ 1, 1 ], [ [ '屬性解放／裝填擴充', 2 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '公會十字α', 8, 'general', 82, [ 0, 0, 0, 0, 0 ], '公會的引導' ],
    [
        [ '公會十字頭飾α', 'helm', [ 1 ], [ [ '精靈加護', 2 ], [ '雷耐性', 2 ] ] ],
        [ '公會十字戰衣α', 'chest', [ 1 ], [ [ '死裡逃生', 1 ], [ '冰耐性', 2 ] ] ],
        [ '公會十字腕甲α', 'arm', [ 1 ], [ [ '整備', 1 ], [ '水耐性', 2 ] ] ],
        [ '公會十字腰甲α', 'waist', [ 1 ], [ [ '不屈', 1 ], [ '龍耐性', 2 ] ] ],
        [ '公會十字靴α', 'leg', [ 1 ], [ [ '飛燕', 1 ], [ '火耐性', 2 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '公會十字β', 8, 'general', 82, [ 0, 0, 0, 0, 0 ], '公會的引導' ],
    [
        [ '公會十字頭飾β', 'helm', [ 1, 1, 1 ], [ [ '精靈加護', 2 ] ] ],
        [ '公會十字戰衣β', 'chest', [ 3 ], [ [ '死裡逃生', 1 ] ] ],
        [ '公會十字腕甲β', 'arm', [ 3 ], [ [ '整備', 1 ] ] ],
        [ '公會十字腰甲β', 'waist', [ 1, 1, 1 ], [ [ '不屈', 1 ] ] ],
        [ '公會十字靴β', 'leg', [ 3 ], [ [ '飛燕', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '追蹤者α', 8, 'general', 90, [ 2, 2, 2, 2, 2 ], '調查團的引導' ],
    [
        [ '追蹤者頭盔α', 'helm', [ 1 ], [ [ '整備', 1 ], [ '採集達人', 1 ] ] ],
        [ '追蹤者鎧甲α', 'chest', null, [ [ '廣域化', 2 ], [ '攀岩者', 1 ] ] ],
        [ '追蹤者腕甲α', 'arm', [ 1 ], [ [ '閃光強化', 1 ], [ '剝取鐵人', 1 ] ] ],
        [ '追蹤者腰甲α', 'waist', [ 1 ], [ [ '最愛菇類', 1 ], [ '搬運達人', 1 ] ] ],
        [ '追蹤者護腿α', 'leg', null, [ [ '潛伏', 2 ], [ '滑走強化', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '追蹤者β', 8, 'general', 90, [ 2, 2, 2, 2, 2 ], '調查團的引導' ],
    [
        [ '追蹤者頭盔β', 'helm', [ 2 ], [ [ '整備', 1 ] ] ],
        [ '追蹤者鎧甲β', 'chest', [ 1 ], [ [ '廣域化', 2 ] ] ],
        [ '追蹤者腕甲β', 'arm', [ 2 ], [ [ '閃光強化', 1 ] ] ],
        [ '追蹤者腰甲β', 'waist', [ 2 ], [ [ '最愛菇類', 1 ] ] ],
        [ '追蹤者護腿β', 'leg', [ 2 ], [ [ '潛伏', 2 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '絢輝龍鎧羅α', 8, 'general', 92, [ 4, -2, 3, -4, -2 ], null ],
    [
        [ '絢輝龍鎧羅頭盔α', 'helm', [ 1 ], [ [ '屬性解放／裝填擴充', 1 ], [ '挑戰者', 1 ] ] ],
        [ '絢輝龍鎧羅鎧甲α', 'chest', [ 1 ], [ [ '昏厥耐性', 2 ], [ '超會心', 2 ] ] ],
        [ '絢輝龍鎧羅腕甲α', 'arm', [ 1 ], [ [ '屬性解放／裝填擴充', 1 ], [ '強化持續', 2 ] ] ],
        [ '絢輝龍鎧羅腰甲α', 'waist', [ 1 ], [ [ '屬性解放／裝填擴充', 1 ], [ '匠', 2 ] ] ],
        [ '絢輝龍鎧羅護腿α', 'leg', [ 1 ], [ [ '廣域化', 2 ], [ '無傷', 2 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '絢輝龍鎧羅β', 8, 'general', 92, [ 4, -2, 3, -4, -2 ], null ],
    [
        [ '絢輝龍鎧羅頭盔β', 'helm', [ 2, 1 ], [ [ '屬性解放／裝填擴充', 1 ], [ '挑戰者', 1 ] ] ],
        [ '絢輝龍鎧羅鎧甲β', 'chest', [ 3, 1 ], [ [ '昏厥耐性', 2 ], [ '超會心', 1 ] ] ],
        [ '絢輝龍鎧羅腕甲β', 'arm', [ 3, 1 ], [ [ '屬性解放／裝填擴充', 1 ], [ '強化持續', 1 ] ] ],
        [ '絢輝龍鎧羅腰甲β', 'waist', [ 3, 1 ], [ [ '屬性解放／裝填擴充', 1 ], [ '匠', 1 ] ] ],
        [ '絢輝龍鎧羅護腿β', 'leg', [ 2, 1 ], [ [ '廣域化', 2 ], [ '無傷', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '但丁α', 8, 'general', 84, [ 3, -3, 3, -3, 3 ], null ],
    [
        [ '但丁假髮α', 'helm', [ 1 ], [ [ '弱點特效', 1 ], [ '看破', 1 ] ] ],
        [ '但丁風衣α', 'chest', [ 3 ], [ [ '迴避性能', 1 ], [ '看破', 1 ] ] ],
        [ '但丁手套α', 'arm', [ 3 ], [ [ '迴避性能', 1 ], [ '特殊射擊強化', 1 ] ] ],
        [ '但丁皮帶α', 'waist', [ 3 ], [ [ '迴避性能', 1 ], [ '力量解放', 1 ] ] ],
        [ '但丁皮褲靴α', 'leg', [ 1, 1 ], [ [ '弱點特效', 2 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '皇后α', 8, 'general', 90, [ 3, 1, 1, -3, -2 ], '炎妃龍的恩寵' ],
    [
        [ '皇后琴眩α', 'helm', [ 3, 1 ], [ [ '迴避距離UP', 2 ], [ '整備', 1 ] ] ],
        [ '皇后鎧甲α', 'chest', [ 1, 1 ], [ [ '無傷', 2 ], [ '體力增強', 1 ] ] ],
        [ '皇后腕甲α', 'arm', [ 3 ], [ [ '廣域化', 2 ], [ '爆破屬性強化', 2 ] ] ],
        [ '皇后腰甲α', 'waist', [ 2, 1 ], [ [ '整備', 2 ], [ '爆破屬性強化', 1 ] ] ],
        [ '皇后護腿α', 'leg', [ 2, 1 ], [ [ '體力增強', 2 ], [ '廣域化', 2 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '皇后β', 8, 'general', 90, [ 3, 1, 1, -3, -2 ], '炎妃龍的恩寵' ],
    [
        [ '皇后琴眩β', 'helm', [ 3, 2 ], [ [ '迴避距離UP', 2 ] ] ],
        [ '皇后鎧甲β', 'chest', [ 1, 1, 1 ], [ [ '無傷', 2 ] ] ],
        [ '皇后腕甲β', 'arm', [ 3, 2 ], [ [ '廣域化', 2 ] ] ],
        [ '皇后腰甲β', 'waist', [ 2, 2 ], [ [ '整備', 2 ] ] ],
        [ '皇后護腿β', 'leg', [ 2, 2 ], [ [ '體力增強', 2 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '烏爾德γ', 8, 'general', 92, [ -4, 4, 1, -1, -3 ], '屍套龍的命脈' ],
    [
        [ '烏爾德頭盔γ', 'helm', [ 3 ], [ [ '體力回復量UP', 2 ], [ '龍屬性攻擊強化', 1 ] ] ],
        [ '烏爾德鎧甲γ', 'chest', [ 3 ], [ [ '無傷', 1 ], [ '體力回復量UP', 1 ] ] ],
        [ '烏爾德腕甲γ', 'arm', [ 3, 2 ], [ [ '龍屬性攻擊強化', 3 ] ] ],
        [ '烏爾德腰甲γ', 'waist', [ 2, 1, 1 ], [ [ '回復速度', 2 ], [ '龍屬性攻擊強化', 1 ] ] ],
        [ '烏爾德護腿γ', 'leg', [ 3, 1 ], [ [ '無傷', 1 ], [ '回復速度', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '麒麟γ', 8, 'general', 92, [ -3, -2, 4, -2, 2 ], '麒麟的恩寵' ],
    [
        [ '麒麟角γ', 'helm', [ 2 ], [ [ '屬性異常狀態耐性', 1 ], [ '雷屬性攻擊強化', 3 ] ] ],
        [ '麒麟服飾γ', 'chest', [ 1, 1 ], [ [ '屬性解放／裝填擴充', 2 ] ] ],
        [ '麒麟長腕甲γ', 'arm', [ 2, 2 ], [ [ '屬性異常狀態耐性', 1 ], [ '屬性解放／裝填擴充', 1 ] ] ],
        [ '麒麟腰環γ', 'waist', [ 1, 1 ], [ [ '跑者', 2 ] ] ],
        [ '麒麟護脛γ', 'leg', [ 3 ], [ [ '屬性異常狀態耐性', 1 ], [ '雷屬性攻擊強化', 2 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '騰龍α', 8, 'general', 92, [ -2, -2, 3, -2, 4 ], '龍騎士之證' ],
    [
        [ '騰龍戰盔α', 'helm', [ 3, 1 ], [ [ '超會心', 1 ], [ '飛燕', 1 ] ] ],
        [ '騰龍戰鎧α', 'chest', [ 3 ], [ [ '看破', 2 ], [ '超會心', 1 ] ] ],
        [ '騰龍腕甲α', 'arm', [ 2, 2 ], [ [ '看破', 2 ], [ '攻擊', 1 ] ] ],
        [ '騰龍腰甲α', 'waist', [ 3 ], [ [ '看破', 2 ], [ '強化持續', 1 ] ] ],
        [ '騰龍護腿α', 'leg', [ 2 ], [ [ '攻擊', 2 ], [ '超會心', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '帝王γ', 8, 'general', 92, [ 3, -3, 1, -3, 1 ], '炎王龍的武技' ],
    [
        [ '帝王皇冠γ', 'helm', [ 2, 2 ], [ [ '看破', 2 ] ] ],
        [ '帝王鎧甲γ', 'chest', [ 2 ], [ [ '力量解放', 2 ], [ '弱點特效', 1 ] ] ],
        [ '帝王腕甲γ', 'arm', [ 3 ], [ [ '看破', 3 ] ] ],
        [ '帝王腰甲γ', 'waist', [ 1, 1 ], [ [ '力量解放', 3 ] ] ],
        [ '帝王護腿γ', 'leg', [ 3, 1 ], [ [ '看破', 2 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '鋼龍γ', 8, 'general', 92, [ 0, 2, -3, 4, -2 ], '鋼龍的飛翅' ],
    [
        [ '鋼龍強力γ', 'helm', [ 2 ], [ [ '匠', 2 ] ] ],
        [ '鋼龍恐懼γ', 'chest', [ 2 ], [ [ '冰屬性攻擊強化', 3 ], [ '迴避距離UP', 1 ] ] ],
        [ '鋼龍剛強γ', 'arm', [ 1, 1, 1 ], [ [ '集中', 2 ] ] ],
        [ '鋼龍安穩γ', 'waist', [ 1, 1 ], [ [ '匠', 2 ] ] ],
        [ '鋼龍踏實γ', 'leg', [ 3 ], [ [ '迴避性能', 2 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '皇后γ', 8, 'general', 90, [ 3, 1, 1, -3, -2 ], '炎妃龍的恩寵' ],
    [
        [ '皇后琴眩γ', 'helm', [ 1, 1, 1 ], [ [ '廣域化', 2 ], [ '無傷', 1 ] ] ],
        [ '皇后鎧甲γ', 'chest', [ 3 ], [ [ '耳塞', 2 ], [ '整備', 1 ] ] ],
        [ '皇后腕甲γ', 'arm', [ 3, 1 ], [ [ '挑戰者', 2 ], [ '迴避距離UP', 1 ] ] ],
        [ '皇后腰甲γ', 'waist', [ 3 ], [ [ '迴避性能', 2 ], [ '體力增強', 2 ] ] ],
        [ '皇后護腿γ', 'leg', [ 3 ], [ [ '耳塞', 2 ], [ '挑戰者', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '絢輝龍鎧羅γ', 8, 'general', 90, [ 4, -2, 3, -4, -2 ], null ],
    [
        [ '絢輝龍鎧羅琴眩γ', 'helm', [ 3, 1, 1 ], [ [ '強化持續', 1 ], [ '昏厥耐性', 1 ] ] ],
        [ '絢輝龍鎧羅鎧甲γ', 'chest', [ 1 ], [ [ '匠', 2 ], [ '挑戰者', 1 ] ] ],
        [ '絢輝龍鎧羅腕甲γ', 'arm', [ 1 ], [ [ '匠', 2 ], [ '體術', 1 ] ] ],
        [ '絢輝龍鎧羅腰甲γ', 'waist', [ 3 ], [ [ '超會心', 1 ], [ '弱點特效', 1 ] ] ],
        [ '絢輝龍鎧羅護腿γ', 'leg', [ 3, 1 ], [ [ '挑戰者', 2 ], [ '熱傷害無效', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '冥燈幽火γ', 8, 'general', 90, [ -3, 2, 2, 2, -4 ], '冥燈龍的神秘' ],
    [
        [ '異形大種頭飾γ', 'helm', [ 3, 1, 1 ], [ [ '屬性異常狀態耐性', 2 ], [ '強化持續', 1 ] ] ],
        [ '異形大種皮γ', 'chest', [ 1, 1 ], [ [ '減輕膽怯', 2 ] ] ],
        [ '異形大種爪γ', 'arm', [ 2, 2, 1 ], [ [ '強化持續', 1 ], [ '特殊射擊強化', 1 ] ] ],
        [ '異形大種脊椎γ', 'waist', [ 3, 1 ], [ [ '超會心', 1 ] ] ],
        [ '異形大種護腿γ', 'leg', [ 2, 1, 1 ], [ [ '超會心', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '鑄島熔岩γ', 8, 'general', 90, [ 4, -3, -1, -2, -3 ], '熔山龍的奧秘' ],
    [
        [ '鑄島熔岩頭飾γ', 'helm', [ 2 ], [ [ '風壓耐性', 2 ], [ '看破', 2 ] ] ],
        [ '鑄島熔岩皮γ', 'chest', [ 1, 1, 1 ], [ [ '耐震', 2 ] ] ],
        [ '鑄島熔岩鋼爪γ', 'arm', [ 3, 1 ], [ [ '耳塞', 1 ] ] ],
        [ '鑄島熔岩腰甲γ', 'waist', [ 3, 2 ], [ [ '炸彈客', 2 ], [ '看破', 1 ] ] ],
        [ '鑄島熔岩護腿γ', 'leg', [ 3, 2 ], [ [ '爆破屬性強化', 2 ], [ '看破', 1 ] ] ]
    ]
));

export default armors;
