'use strict';
/**
 * Dataset Armors
 *
 * @package     MHW Calculator
 * @author      Scar Wu
 * @copyright   Copyright (c) Scar Wu (http://scar.tw)
 * @link        https://github.com/scarwu/MHWCalculator
 */

let combine = (common, list) => {
    return list.map((item) => {
        return {
            series: common[0],
            rare: common[1],
            general: common[2],
            defense: common[3],
            resistance: common[4],
            set: (null !== common[5]) ? {
                name: common[5]
            } : null,
            name: item[0],
            type: item[1],
            slots: (null !== item[2]) ? item[2].map((size) => {
                return {
                    size: size
                }
            }) : null,
            skills: (null !== item[3]) ? item[3].map((skill) => {
                return {
                    name: skill[0],
                    level: skill[1]
                };
            }) : null
        };
    });
};

let armors = [];

armors = armors.concat(combine(
    [ '熔山龍α', 6, 'general', 76, [ 4, -3, -1, -2, -3 ], '熔山龍的奧秘' ],
    [
        [ '熔山龍頭盔α', 'helm', null, [ [ '匠', 1 ], [ '爆破屬性強化', 1 ] ] ],
        [ '熔山龍鎧甲α', 'chest', null, [ [ '爆破屬性強化', 2 ], [ '風壓耐性', 1 ] ] ],
        [ '熔山龍腕甲α', 'arm', null, [ [ '屬性解放／裝填擴充', 1 ], [ '炸彈客', 1 ] ] ],
        [ '熔山龍腰甲α', 'waist', null, [ [ '不屈', 1 ], [ '耐震', 1 ] ] ],
        [ '熔山龍護腿α', 'leg', null, [ [ '炸彈客', 1 ], [ '耳塞', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '熔山龍β', 6, 'general', 76, [ 4, -3, -1, -2, -3 ], '熔山龍的奧秘' ],
    [
        [ '熔山龍頭盔β', 'helm', [ 1 ], [ [ '匠', 1 ] ] ],
        [ '熔山龍鎧甲β', 'chest', [ 2 ], [ [ '爆破屬性強化', 2 ] ] ],
        [ '熔山龍腕甲β', 'arm', [ 1 ], [ [ '屬性解放／裝填擴充', 1 ] ] ],
        [ '熔山龍腰甲β', 'waist', [ 2 ], [ [ '不屈', 1 ] ] ],
        [ '熔山龍護腿β', 'leg', [ 2 ], [ [ '炸彈客', 2 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '骨鎚龍α', 6, 'general', 78, [ 0, 2, 0, -1, -2 ], null ],
    [
        [ '骨鎚龍頭盔α', 'helm', null, [ [ '耐震', 2 ] ] ],
        [ '骨鎚龍鎧甲α', 'chest', null, [ [ '睡眠屬性強化', 1 ], [ '裂傷耐性', 1 ] ] ],
        [ '骨鎚龍腕甲α', 'arm', null, [ [ '睡眠屬性強化', 2 ], [ '防禦性能', 1 ] ] ],
        [ '骨鎚龍腰甲α', 'waist', null, [ [ '防禦性能', 2 ] ] ],
        [ '骨鎚龍護腿α', 'leg', null, [ [ '裂傷耐性', 2 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '骨鎚龍β', 6, 'general', 78, [ 0, 2, 0, -1, -2 ], null ],
    [
        [ '骨鎚龍頭盔β', 'helm', [ 2 ], [ [ '耐震', 1 ] ] ],
        [ '骨鎚龍鎧甲β', 'chest', [ 1 ], [ [ '睡眠屬性強化', 1 ] ] ],
        [ '骨鎚龍腕甲β', 'arm', [ 1 ], [ [ '睡眠屬性強化', 1 ], [ '防禦性能', 1 ] ] ],
        [ '骨鎚龍腰甲β', 'waist', [ 2 ], [ [ '防禦性能', 1 ] ] ],
        [ '骨鎚龍護腿β', 'leg', [ 1 ], [ [ '裂傷耐性', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '火龍心α', 6, 'general', 84, [ 3, 0, 0, -3, -4 ], '櫻火龍的奧秘' ],
    [
        [ '火龍心頭盔α', 'helm', null, [ [ '迴避距離UP', 1 ], [ '毒屬性強化', 1 ] ] ],
        [ '火龍心鎧甲α', 'chest', null, [ [ '整備', 2 ] ] ],
        [ '火龍心腕甲α', 'arm', null, [ [ '風壓耐性', 2 ] ] ],
        [ '火龍心腰甲α', 'waist', null, [ [ '匠', 1 ], [ '毒耐性', 1 ] ] ],
        [ '火龍心護腿α', 'leg', null, [ [ '整備', 1 ], [ '風壓耐性', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '火龍心β', 6, 'general', 84, [ 3, 0, 0, -3, -4 ], '櫻火龍的奧秘' ],
    [
        [ '火龍心頭盔β', 'helm', [ 2 ], [ [ '迴避距離UP', 1 ] ] ],
        [ '火龍心鎧甲β', 'chest', [ 1, 1 ], [ [ '整備', 1 ] ] ],
        [ '火龍心腕甲β', 'arm', [ 2 ], [ [ '風壓耐性', 1 ] ] ],
        [ '火龍心腰甲β', 'waist', [ 1 ], [ [ '匠', 1 ] ] ],
        [ '火龍心護腿β', 'leg', [ 2 ], [ [ '整備', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '熔岩龍α', 6, 'general', 88, [ 3, -3, 1, -2, 2 ], null ],
    [
        [ '熔岩龍頭盔α', 'helm', null, [ [ '火屬性攻擊強化', 2 ], [ '收刀術', 1 ] ] ],
        [ '熔岩龍鎧甲α', 'chest', null, [ [ '火屬性攻擊強化', 2 ], [ '熱傷害無效', 1 ] ] ],
        [ '熔岩龍腕甲α', 'arm', [ 2 ], [ [ '滑走強化', 1 ], [ '廣域化', 1 ] ] ],
        [ '熔岩龍腰甲α', 'waist', null, [ [ '收刀術', 2 ], [ '體力回復量UP', 1 ] ] ],
        [ '熔岩龍護腿α', 'leg', [ 1 ], [ [ '散彈・剛射強化', 1 ], [ '火屬性攻擊強化', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '熔岩龍β', 6, 'general', 88, [ 3, -3, 1, -2, 2 ], null ],
    [
        [ '熔岩龍頭盔β', 'helm', [ 1, 1 ], [ [ '火屬性攻擊強化', 1 ], [ '收刀術', 1 ] ] ],
        [ '熔岩龍鎧甲β', 'chest', [ 1, 1 ], [ [ '火屬性攻擊強化', 2 ] ] ],
        [ '熔岩龍腕甲β', 'arm', [ 3 ], [ [ '滑走強化', 1 ] ] ],
        [ '熔岩龍腰甲β', 'waist', [ 1 ], [ [ '收刀術', 2 ] ] ],
        [ '熔岩龍護腿β', 'leg', [ 2 ], [ [ '散彈・剛射強化', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '鑄鐵α', 6, 'general', 82, [ -2, 0, 3, -1, 0 ], null ],
    [
        [ '鑄鐵頭盔α', 'helm', null, [ [ '雷屬性攻擊強化', 2 ] ] ],
        [ '鑄鐵鎧甲α', 'chest', null, [ [ '雷耐性', 2 ] ] ],
        [ '鑄鐵腕甲α', 'arm', null, [ [ '體力增強', 2 ], [ '雷屬性攻擊強化', 1 ] ] ],
        [ '鑄鐵腰甲α', 'waist', null, [ [ '風壓耐性', 2 ] ] ],
        [ '鑄鐵護腿α', 'leg', null, [ [ '防禦', 2 ], [ '風壓耐性', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '鑄鐵β', 6, 'general', 82, [ -2, 0, 3, -1, 0 ], null ],
    [
        [ '鑄鐵頭盔β', 'helm', [ 1 ], [ [ '雷屬性攻擊強化', 1 ] ] ],
        [ '鑄鐵鎧甲β', 'chest', [ 1 ], [ [ '雷耐性', 1 ] ] ],
        [ '鑄鐵腕甲β', 'arm', [ 1 ], [ [ '體力增強', 2 ] ] ],
        [ '鑄鐵腰甲β', 'waist', [ 3 ], [ [ '風壓耐性', 1 ] ] ],
        [ '鑄鐵護腿β', 'leg', [ 2 ], [ [ '防禦', 2 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '艾路頭套α', 6, 'general', 88, [ 2, 2, 2, 2, 2 ], null ],
    [
        [ '艾路頭套α', 'helm', null, [ [ '指示隨從', 3 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '知性眼鏡α', 6, 'general', 88, [ 2, 2, 2, 2, 2 ], null ],
    [
        [ '知性眼鏡α', 'helm', [ 1 ], [ [ '看破', 2 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '風漂龍α', 6, 'general', 86, [ -1, 2, -3, 3, 0 ], '風漂龍的恩竉' ],
    [
        [ '風漂龍頭盔α', 'helm', null, [ [ '精靈加護', 2 ], [ '冰屬性攻擊強化', 1 ] ] ],
        [ '風漂龍鎧甲α', 'chest', null, [ [ '迴避性能', 2 ], [ '精靈加護', 1 ] ] ],
        [ '風漂龍腕甲α', 'arm', null, [ [ '飛燕', 1 ], [ '迴避性能', 1 ] ] ],
        [ '風漂龍腰甲α', 'waist', null, [ [ '冰屬性攻擊強化', 2 ], [ '風壓耐性', 1 ] ] ],
        [ '風漂龍護腿α', 'leg', null, [ [ '冰耐性', 2 ], [ '拔刀術【技】', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '風漂龍β', 6, 'general', 86, [ -1, 2, -3, 3, 0 ], '風漂龍的恩竉' ],
    [
        [ '風漂龍頭盔β', 'helm', [ 1 ], [ [ '精靈加護', 2 ] ] ],
        [ '風漂龍鎧甲β', 'chest', [ 1 ], [ [ '迴避性能', 2 ] ] ],
        [ '風漂龍腕甲β', 'arm', [ 3 ], [ [ '飛燕', 1 ] ] ],
        [ '風漂龍腰甲β', 'waist', [ 2 ], [ [ '冰屬性攻擊強化', 2 ] ] ],
        [ '風漂龍護腿β', 'leg', [ 3 ], [ [ '冰耐性', 2 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '角龍α', 6, 'general', 86, [ 3, -2, 0, -3, 2 ], '角龍之奧秘' ],
    [
        [ '角龍頭盔α', 'helm', null, [ [ '拔刀術【技】', 2 ], [ '火場怪力', 1 ] ] ],
        [ '角龍鎧甲α', 'chest', null, [ [ 'KO術', 2 ], [ '火場怪力', 1 ] ] ],
        [ '角龍腕甲α', 'arm', null, [ [ '火場怪力', 2 ], [ '耐震', 1 ] ] ],
        [ '角龍腰甲α', 'waist', null, [ [ '跑者', 2 ], [ '拔刀術【技】', 1 ] ] ],
        [ '角龍護腿α', 'leg', null, [ [ '耐震', 2 ], [ 'KO術', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '角龍β', 6, 'general', 86, [ 3, -2, 0, -3, 2 ], '角龍之奧秘' ],
    [
        [ '角龍頭盔β', 'helm', [ 2 ], [ [ '拔刀術【技】', 2 ] ] ],
        [ '角龍鎧甲β', 'chest', [ 2 ], [ [ 'KO術', 2 ] ] ],
        [ '角龍腕甲β', 'arm', [ 2 ], [ [ '火場怪力', 2 ] ] ],
        [ '角龍腰甲β', 'waist', [ 2 ], [ [ '跑者', 2 ] ] ],
        [ '角龍護腿β', 'leg', [ 1, 1 ], [ [ '耐震', 2 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '礦石α', 6, 'general', 82, [ 0, -1, -2, 3, 0 ], null ],
    [
        [ '礦石頭盔α', 'helm', null, [ [ '冰耐性', 2 ], [ '耳塞', 1 ] ] ],
        [ '礦石鎧甲α', 'chest', null, [ [ '耳塞', 2 ], [ '冰屬性攻擊強化', 1 ] ] ],
        [ '礦石腕甲α', 'arm', null, [ [ '防禦', 2 ], [ '冰屬性攻擊強化', 1 ] ] ],
        [ '礦石腰甲α', 'waist', null, [ [ '砲彈裝填數UP', 1 ], [ '防禦', 1 ] ] ],
        [ '礦石護腿α', 'leg', null, [ [ '砲擊手', 1 ], [ '冰耐性', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '礦石β', 6, 'general', 82, [ 0, -1, -2, 3, 0 ], null ],
    [
        [ '礦石頭盔β', 'helm', [ 2 ], [ [ '冰耐性', 2 ] ] ],
        [ '礦石鎧甲β', 'chest', [ 2 ], [ [ '耳塞', 1 ], [ '冰屬性攻擊強化', 1 ] ] ],
        [ '礦石腕甲β', 'arm', [ 1 ], [ [ '防禦', 2 ] ] ],
        [ '礦石腰甲β', 'waist', [ 1 ], [ [ '砲彈裝填數UP', 1 ] ] ],
        [ '礦石護腿β', 'leg', [ 1 ], [ [ '砲擊手', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '慘爪龍α', 6, 'general', 86, [ 2, 2, -2, -3, 0 ], '慘爪龍的奧秘' ],
    [
        [ '慘爪龍頭盔α', 'helm', null, [ [ '裂傷耐性', 2 ], [ '看破', 1 ] ] ],
        [ '慘爪龍鎧甲α', 'chest', null, [ [ '砥石使用高速化', 2 ], [ '裂傷耐性', 1 ] ] ],
        [ '慘爪龍腕甲α', 'arm', null, [ [ '體術', 1 ], [ '看破', 1 ] ] ],
        [ '慘爪龍腰甲α', 'waist', null, [ [ '看破', 2 ], [ '砥石使用高速化', 1 ] ] ],
        [ '慘爪龍護腿α', 'leg', null, [ [ '收刀術', 1 ], [ '看破', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '慘爪龍β', 6, 'general', 86, [ 2, 2, -2, -3, 0 ], '慘爪龍的奧秘' ],
    [
        [ '慘爪龍頭盔β', 'helm', [ 2 ], [ [ '裂傷耐性', 2 ] ] ],
        [ '慘爪龍鎧甲β', 'chest', [ 1 ], [ [ '砥石使用高速化', 2 ] ] ],
        [ '慘爪龍腕甲β', 'arm', [ 1 ], [ [ '體術', 1 ] ] ],
        [ '慘爪龍腰甲β', 'waist', [ 2 ], [ [ '看破', 2 ] ] ],
        [ '慘爪龍護腿β', 'leg', [ 1 ], [ [ '收刀術', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '火龍α', 6, 'general', 86, [ 3, 1, -2, 1, -3 ], '火龍奧秘' ],
    [
        [ '火龍頭盔α', 'helm', null, [ [ '攻擊', 2 ], [ '火屬性攻擊強化', 1 ] ] ],
        [ '火龍鎧甲α', 'chest', null, [ [ '弱點特效', 2 ], [ '火屬性攻擊強化', 1 ] ] ],
        [ '火龍腕甲α', 'arm', null, [ [ '火耐性', 2 ], [ '攻擊', 1 ] ] ],
        [ '火龍腰甲α', 'waist', null, [ [ '火屬性攻擊強化', 2 ], [ '集中', 1 ] ] ],
        [ '火龍護腿α', 'leg', null, [ [ '跳躍鐵人', 1 ], [ '弱點特效', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '火龍β', 6, 'general', 86, [ 3, 1, -2, 1, -3 ], '火龍奧秘' ],
    [
        [ '火龍頭盔β', 'helm', [ 1 ], [ [ '攻擊', 2 ] ] ],
        [ '火龍鎧甲β', 'chest', [ 1 ], [ [ '弱點特效', 2 ] ] ],
        [ '火龍腕甲β', 'arm', [ 1 ], [ [ '火耐性', 2 ] ] ],
        [ '火龍腰甲β', 'waist', [ 2 ], [ [ '火屬性攻擊強化', 2 ] ] ],
        [ '火龍護腿β', 'leg', [ 3 ], [ [ '跳躍鐵人', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '旅團α', 6, 'general', 84, [ 1, 0, 2, 0, 2 ], null ],
    [
        [ '旅團頭盔α', 'helm', null, [ [ '回復速度', 2 ], [ '吹笛名人', 1 ] ] ],
        [ '旅團鎧甲α', 'chest', [ 2 ], [ [ '精靈加護', 2 ] ] ],
        [ '旅團腕甲α', 'arm', null, [ [ '砲擊手', 2 ], [ '精靈加護', 1 ] ] ],
        [ '旅團腰甲α', 'waist', null, [ [ '地質學', 2 ], [ '回復速度', 1 ] ] ],
        [ '旅團護腿α', 'leg', [ 1 ], [ [ '研究者', 1 ], [ '地質學', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '旅團β', 6, 'general', 84, [ 1, 0, 2, 0, 2 ], null ],
    [
        [ '旅團頭盔β', 'helm', [ 1 ], [ [ '回復速度', 2 ] ] ],
        [ '旅團鎧甲β', 'chest', [ 2, 2 ], [ [ '精靈加護', 1 ] ] ],
        [ '旅團腕甲β', 'arm', [ 1 ], [ [ '砲擊手', 2 ] ] ],
        [ '旅團腰甲β', 'waist', [ 1 ], [ [ '地質學', 2 ] ] ],
        [ '旅團護腿β', 'leg', [ 3 ], [ [ '研究者', 1 ] ] ]
    ]
));

export default armors;
