'use strict';
/**
 * Dataset Armors
 *
 * @package     MHW Calculator
 * @author      Scar Wu
 * @copyright   Copyright (c) Scar Wu (http://scar.tw)
 * @link        https://github.com/scarwu/MHWCalculator
 */

let combine = (common, list) => {
    return list.map((item) => {
        return {
            series: common[0],
            rare: common[1],
            general: common[2],
            defense: common[3],
            resistance: common[4],
            set: (null !== common[5]) ? {
                name: common[5]
            } : null,
            name: item[0],
            type: item[1],
            slots: (null !== item[2]) ? item[2].map((size) => {
                return {
                    size: size
                }
            }) : null,
            skills: (null !== item[3]) ? item[3].map((skill) => {
                return {
                    name: skill[0],
                    level: skill[1]
                };
            }) : null
        };
    });
};

let armors = [];

armors = armors.concat(combine(
    [ '合金α', 5, 'general', 74, [ -2, 0, -2, -2, 0 ], null ],
    [
        [ '合金頭盔α', 'helm', null, [ [ '風壓耐性', 1 ], [ '防禦', 1 ] ] ],
        [ '合金鎧甲α', 'chest', null, [ [ '水耐性', 2 ] ] ],
        [ '合金腕甲α', 'arm', null, [ [ '防禦', 1 ], [ '砥石使用高速化', 1 ] ] ],
        [ '合金腰甲α', 'waist', null, [ [ '毒耐性', 1 ], [ '水耐性', 1 ] ] ],
        [ '合金護腿α', 'leg', null, [ [ '砥石使用高速化', 2 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '合金β', 5, 'general', 74, [ -2, 0, -2, -2, 0 ], null ],
    [
        [ '合金頭盔β', 'helm', [ 1 ], [ [ '風壓耐性', 1 ] ] ],
        [ '合金鎧甲β', 'chest', [ 1 ], [ [ '水耐性', 1 ] ] ],
        [ '合金腕甲β', 'arm', [ 1 ], [ [ '防禦', 1 ] ] ],
        [ '合金腰甲β', 'waist', [ 1 ], [ [ '毒耐性', 1 ] ] ],
        [ '合金護腿β', 'leg', [ 1 ], [ [ '砥石使用高速化', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '浮空龍α', 5, 'general', 82, [ -3, 2, 0, 1, 0 ], null ],
    [
        [ '浮空龍頭盔α', 'helm', null, [ [ '耐力急速回復', 2 ] ] ],
        [ '浮空龍鎧甲α', 'chest', null, [ [ '騎乘名人', 1 ], [ '砲術', 1 ] ] ],
        [ '浮空龍腕甲α', 'arm', null, [ [ '砲術', 2 ] ] ],
        [ '浮空龍腰甲α', 'waist', null, [ [ '精靈加護', 2 ] ] ],
        [ '浮空龍護腿α', 'leg', null, [ [ '耐力急速回復', 1 ], [ '風壓耐性', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '浮空龍β', 5, 'general', 82, [ -3, 2, 0, 1, 0 ], null ],
    [
        [ '浮空龍頭盔β', 'helm', [ 2 ], [ [ '耐力急速回復', 1 ] ] ],
        [ '浮空龍鎧甲β', 'chest', [ 1 ], [ [ '騎乘名人', 1 ] ] ],
        [ '浮空龍腕甲β', 'arm', [ 1 ], [ [ '砲術', 1 ] ] ],
        [ '浮空龍腰甲β', 'waist', [ 1 ], [ [ '精靈加護', 1 ] ] ],
        [ '浮空龍護腿β', 'leg', [ 1, 1 ], [ [ '風壓耐性', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '獨角仙α', 5, 'male', 80, [ -1, -1, 2, 0, 2 ], null ],
    [
        [ '獨角仙護頭α', 'helm', null, [ [ '迴避性能', 2 ], [ '植生學', 1 ] ] ],
        [ '獨角仙上身α', 'chest', null, [ [ '收刀術', 2 ], [ '植生學', 1 ] ] ],
        [ '獨角仙護袖α', 'arm', [ 1 ], [ [ '飛身躍入', 1 ], [ '植生學', 2 ] ] ],
        [ '獨角仙護腰具α', 'waist', [ 1 ], [ [ '蜂蜜獵人', 1 ], [ '收刀術', 1 ] ] ],
        [ '獨角仙腳α', 'leg', [ 1 ], [ [ '探索者的幸運', 1 ], [ '迴避性能', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '獨角仙β', 5, 'male', 80, [ -1, -1, 2, 0, 2 ], null ],
    [
        [ '獨角仙護頭β', 'helm', [ 1 ], [ [ '迴避性能', 2 ] ] ],
        [ '獨角仙上身β', 'chest', [ 1 ], [ [ '收刀術', 2 ] ] ],
        [ '獨角仙護袖β', 'arm', [ 2, 1 ], [ [ '植生學', 2 ] ] ],
        [ '獨角仙護腰具β', 'waist', [ 2, 1 ], [ [ '蜂蜜獵人', 1 ] ] ],
        [ '獨角仙腳β', 'leg', [ 2, 1 ], [ [ '探索者的幸運', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '飛雷龍α', 5, 'general', 82, [ 0, -3, 3, 0, 0 ], null ],
    [
        [ '飛雷龍頭盔α', 'helm', null, [ [ '體術', 2 ] ] ],
        [ '飛雷龍鎧甲α', 'chest', null, [ [ '跳躍鐵人', 1 ], [ '迴避距離UP', 1 ] ] ],
        [ '飛雷龍腕甲α', 'arm', null, [ [ '迴避距離UP', 2 ] ] ],
        [ '飛雷龍腰甲α', 'waist', null, [ [ '雷屬性攻擊強化', 2 ], [ '雷耐性', 1 ] ] ],
        [ '飛雷龍護腿α', 'leg', null, [ [ '雷耐性', 1 ], [ '體術', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '飛雷龍β', 5, 'general', 82, [ 0, -3, 3, 0, 0 ], null ],
    [
        [ '飛雷龍頭盔β', 'helm', [ 2 ], [ [ '體術', 1 ] ] ],
        [ '飛雷龍鎧甲β', 'chest', [ 2 ], [ [ '跳躍鐵人', 1 ] ] ],
        [ '飛雷龍腕甲β', 'arm', [ 2 ], [ [ '迴避距離UP', 1 ] ] ],
        [ '飛雷龍腰甲β', 'waist', [ 1, 1 ], [ [ '雷屬性攻擊強化', 1 ] ] ],
        [ '飛雷龍護腿β', 'leg', [ 1, 1 ], [ [ '雷耐性', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '咬魚α', 5, 'general', 82, [ 0, 5, 0, 0, 0 ], null ],
    [
        [ '咬魚靴α', 'leg', null, [ [ '適應水場', 2 ], [ '水屬性攻擊強化', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '咬魚β', 5, 'general', 82, [ 0, 5, 0, 0, 0 ], null ],
    [
        [ '咬魚靴β', 'leg', [ 1 ], [ [ '適應水場', 1 ], [ '水屬性攻擊強化', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '兇顎龍頭盔α', 5, 'general', 78, [ 0, -3, 2, 0, 1 ], null ],
    [
        [ '兇顎龍頭盔α', 'helm', null, [ [ '吹笛名人', 1 ], [ '麻痺耐性', 1 ] ] ],
        [ '兇顎龍鎧甲α', 'chest', null, [ [ '麻痺耐性', 2 ] ] ],
        [ '兇顎龍腕甲α', 'arm', null, [ [ '指示隨從', 2 ] ] ],
        [ '兇顎龍腰甲α', 'waist', null, [ [ '適應瘴氣環境', 1 ], [ '麻痺屬性強化', 1 ] ] ],
        [ '兇顎龍護腿α', 'leg', null, [ [ '麻痺屬性強化', 2 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '兇顎龍β', 5, 'general', 78, [ 0, -3, 2, 0, 1 ], null ],
    [
        [ '兇顎龍頭盔β', 'helm', [ 1 ], [ [ '吹笛名人', 1 ] ] ],
        [ '兇顎龍鎧甲β', 'chest', [ 1 ], [ [ '麻痺耐性', 1 ] ] ],
        [ '兇顎龍腕甲β', 'arm', [ 1 ], [ [ '指示隨從', 1 ] ] ],
        [ '兇顎龍腰甲β', 'waist', [ 1 ], [ [ '適應瘴氣環境', 1 ] ] ],
        [ '兇顎龍護腿β', 'leg', [ 1 ], [ [ '麻痺屬性強化', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '搔鳥α', 5, 'general', 78, [ 0, -3, 0, 1, 0 ], null ],
    [
        [ '搔鳥頭盔α', 'helm', null, [ [ '火耐性', 1 ], [ '弱點特效', 1 ] ] ],
        [ '搔鳥鎧甲α', 'chest', null, [ [ '耐力急速回復', 1 ], [ '看破', 1 ] ] ],
        [ '搔鳥腕甲α', 'arm', null, [ [ '搬運達人', 1 ], [ '看破', 1 ] ] ],
        [ '搔鳥腰甲α', 'waist', null, [ [ '道具使用強化', 2 ] ] ],
        [ '搔鳥護腿α', 'leg', null, [ [ '看破', 1 ], [ '道具使用強化', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '搔鳥β', 5, 'general', 78, [ 0, -3, 0, 1, 0 ], null ],
    [
        [ '搔鳥頭盔β', 'helm', [ 1, 1 ], [ [ '火耐性', 1 ] ] ],
        [ '搔鳥鎧甲β', 'chest', [ 1 ], [ [ '耐力急速回復', 1 ] ] ],
        [ '搔鳥腕甲β', 'arm', [ 2 ], [ [ '搬運達人', 1 ] ] ],
        [ '搔鳥腰甲β', 'waist', [ 2 ], [ [ '道具使用強化', 1 ] ] ],
        [ '搔鳥護腿β', 'leg', [ 1 ], [ [ '看破', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '冠突龍α', 5, 'general', 78, [ 4, 0, 0, 0, 0 ], null ],
    [
        [ '冠突龍護手α', 'arm', null, [ [ '滑走強化', 1 ], [ '集中', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '冠突龍β', 5, 'general', 78, [ 4, 0, 0, 0, 0 ], null ],
    [
        [ '冠突龍護手β', 'arm', [ 1 ], [ [ '滑走強化', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '凶豺龍α', 5, 'general', 78, [ -2, 2, -1, -1, 1 ], null ],
    [
        [ '凶豺龍頭盔α', 'helm', null, [ [ '快吃', 2 ] ] ],
        [ '凶豺龍鎧甲α', 'chest', null, [ [ '威嚇', 2 ] ] ],
        [ '凶豺龍腕甲α', 'arm', null, [ [ '指示隨從', 1 ], [ '威嚇', 1 ] ] ],
        [ '凶豺龍腰甲α', 'waist', null, [ [ '不屈', 1 ], [ '快吃', 1 ] ] ],
        [ '凶豺龍護腿α', 'leg', null, [ [ '蹲下移動速度UP', 1 ], [ '滿足感', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '凶豺龍β', 5, 'general', 78, [ -2, 2, -1, -1, 1 ], null ],
    [
        [ '凶豺龍頭盔β', 'helm', [ 1 ], [ [ '快吃', 1 ] ] ],
        [ '凶豺龍鎧甲β', 'chest', [ 1 ], [ [ '威嚇', 1 ] ] ],
        [ '凶豺龍腕甲β', 'arm', [ 1 ], [ [ '指示隨從', 1 ] ] ],
        [ '凶豺龍腰甲β', 'waist', [ 1 ], [ [ '不屈', 1 ] ] ],
        [ '凶豺龍護腿β', 'leg', [ 1 ], [ [ '蹲下移動速度UP', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '蠻顎龍α', 5, 'general', 82, [ 3, -3, -1, -1, 0 ], '蠻顎龍的鬥志' ],
    [
        [ '蠻顎龍頭盔α', 'helm', null, [ [ '火屬性攻擊強化', 2 ], [ '火耐性', 1 ] ] ],
        [ '蠻顎龍鎧甲α', 'chest', null, [ [ '跑者', 1 ], [ '特殊射擊強化', 1 ] ] ],
        [ '蠻顎龍腕甲α', 'arm', null, [ [ '特殊射擊強化', 1 ], [ '火屬性攻擊強化', 1 ] ] ],
        [ '蠻顎龍腰甲α', 'waist', null, [ [ '火耐性', 1 ], [ '砲術', 1 ] ] ],
        [ '蠻顎龍護腿α', 'leg', null, [ [ '砲術', 2 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '蠻顎龍β', 5, 'general', 82, [ 3, -3, -1, -1, 0 ], '蠻顎龍的鬥志' ],
    [
        [ '蠻顎龍頭盔β', 'helm', [ 2 ], [ [ '火屬性攻擊強化', 2 ] ] ],
        [ '蠻顎龍鎧甲β', 'chest', [ 1, 1 ], [ [ '跑者', 1 ] ] ],
        [ '蠻顎龍腕甲β', 'arm', [ 1 ], [ [ '特殊射擊強化', 1 ] ] ],
        [ '蠻顎龍腰甲β', 'waist', [ 2 ], [ [ '火耐性', 2 ] ] ],
        [ '蠻顎龍護腿β', 'leg', [ 1 ], [ [ '砲術', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '貓蜥龍α', 5, 'general', 78, [ 2, 2, 0, -3, 0 ], null ],
    [
        [ '貓蜥龍護目鏡α', 'helm', null, [ [ '察覺', 1 ], [ '地質學', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '貓蜥龍β', 5, 'general', 78, [ 2, 2, 0, -3, 0 ], null ],
    [
        [ '貓蜥龍護目鏡β', 'helm', [ 1 ], [ [ '察覺', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '泥魚龍α', 5, 'general', 82, [ -1, 2, -3, 0, 0 ], null ],
    [
        [ '泥魚龍頭盔α', 'helm', null, [ [ '適應水場', 2 ] ] ],
        [ '泥魚龍鎧甲α', 'chest', null, [ [ '泥耐性', 1 ], [ '水屬性攻擊強化', 1 ] ] ],
        [ '泥魚龍腕甲α', 'arm', null, [ [ '水屬性攻擊強化', 1 ], [ '適應水場', 1 ] ] ],
        [ '泥魚龍腰甲α', 'waist', null, [ [ '冰耐性', 2 ] ] ],
        [ '泥魚龍護腿α', 'leg', null, [ [ '集中', 2 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '泥魚龍β', 5, 'general', 82, [ -1, 2, -3, 0, 0 ], null ],
    [
        [ '泥魚龍頭盔β', 'helm', [ 1 ], [ [ '適應水場', 1 ] ] ],
        [ '泥魚龍鎧甲β', 'chest', [ 1 ], [ [ '泥耐性', 1 ] ] ],
        [ '泥魚龍腕甲β', 'arm', [ 1 ], [ [ '水屬性攻擊強化', 2 ] ] ],
        [ '泥魚龍腰甲β', 'waist', [ 1 ], [ [ '冰耐性', 1 ] ] ],
        [ '泥魚龍護腿β', 'leg', [ 2 ], [ [ '集中', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '巨甲蟲α', 5, 'general', 76, [ -1, -1, 0, 0, 2 ], null ],
    [
        [ '巨甲蟲頭盔α', 'helm', null, [ [ '異臭名人', 1 ], [ '龍屬性攻擊強化', 1 ] ] ],
        [ '巨甲蟲鎧甲α', 'chest', null, [ [ '適應瘴氣環境', 1 ], [ '飢餓耐性', 1 ] ] ],
        [ '巨甲蟲腕甲α', 'arm', null, [ [ '滿足感', 1 ], [ '飢餓耐性', 1 ] ] ],
        [ '巨甲蟲腰甲α', 'waist', null, [ [ '剝取鐵人', 1 ], [ '飢餓耐性', 1 ] ] ],
        [ '巨甲蟲護腿α', 'leg', null, [ [ '匠', 1 ], [ '龍屬性攻擊強化', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '巨甲蟲β', 5, 'general', 76, [ -1, -1, 0, 0, 2 ], null ],
    [
        [ '巨甲蟲頭盔β', 'helm', [ 1 ], [ [ '異臭名人', 1 ] ] ],
        [ '巨甲蟲鎧甲β', 'chest', [ 1 ], [ [ '適應瘴氣環境', 1 ] ] ],
        [ '巨甲蟲腕甲β', 'arm', [ 1 ], [ [ '滿足感', 1 ] ] ],
        [ '巨甲蟲腰甲β', 'waist', [ 1 ], [ [ '剝取鐵人', 1 ] ] ],
        [ '巨甲蟲護腿β', 'leg', [ 1 ], [ [ '匠', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '鎖甲α', 5, 'general', 70, [ 0, 2, 0, 0, 0 ], null ],
    [
        [ '鎖甲頭盔α', 'helm', null, [ [ '採集達人', 1 ], [ '防禦性能', 1 ] ] ],
        [ '鎖甲鎧甲α', 'chest', null, [ [ '水耐性', 1 ] ] ],
        [ '鎖甲腕甲α', 'arm', null, [ [ '回復速度', 1 ] ] ],
        [ '鎖甲腰甲α', 'waist', null, [ [ '收刀術', 1 ] ] ],
        [ '鎖甲護腿α', 'leg', null, [ [ '體力回復量UP', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '鎖甲β', 5, 'general', 70, [ 0, 2, 0, 0, 0 ], null ],
    [
        [ '鎖甲頭盔β', 'helm', [ 1 ], [ [ '採集達人', 1 ] ] ],
        [ '鎖甲鎧甲β', 'chest', [ 1 ], null ],
        [ '鎖甲腕甲β', 'arm', [ 1 ], null ],
        [ '鎖甲腰甲β', 'waist', [ 1 ], null ],
        [ '鎖甲護腿β', 'leg' ,[ 1 ], null ]
    ]
));

armors = armors.concat(combine(
    [ '眩鳥α', 5, 'general', 78, [ 0, 0, -3, -2, 0 ], null ],
    [
        [ '眩鳥頭盔α', 'helm', null, [ [ '閃光強化', 1 ], [ '昏厥耐性', 1 ] ] ],
        [ '眩鳥鎧甲α', 'chest', null, [ [ '體術', 1 ], [ '水屬性攻擊強化', 2 ] ] ],
        [ '眩鳥腕甲α', 'arm', null, [ [ '昏厥耐性', 2 ], [ '廣域化', 1 ] ] ],
        [ '眩鳥腰甲α', 'waist', null, [ [ '廣域化', 2 ], [ '水屬性攻擊強化', 1 ] ] ],
        [ '眩鳥護腿α', 'leg', null, [ [ '睡眠耐性', 2 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '眩鳥β', 5, 'general', 78, [ 0, 0, -3, -2, 0 ], null ],
    [
        [ '眩鳥頭盔β', 'helm', [ 1 ], [ [ '閃光強化', 1 ] ] ],
        [ '眩鳥鎧甲β', 'chest', [ 1, 1 ], [ [ '體術', 1 ] ] ],
        [ '眩鳥腕甲β', 'arm', [ 1 ], [ [ '昏厥耐性', 2 ] ] ],
        [ '眩鳥腰甲β', 'waist', [ 2 ], [ [ '廣域化', 1 ] ] ],
        [ '眩鳥護腿β', 'leg', [ 1 ], [ [ '睡眠耐性', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '燕尾蝶α', 5, 'female', 80, [ -1, -1, 2, 0, 2 ], null ],
    [
        [ '燕尾蝶護頭α', 'helm', null, [ [ '迴避性能', 2 ], [ '植生學', 1 ] ] ],
        [ '燕尾蝶上身α', 'chest', null, [ [ '收刀術', 2 ], [ '植生學', 1 ] ] ],
        [ '燕尾蝶護袖α', 'arm', [ 1 ], [ [ '飛身躍入', 1 ], [ '植生學', 2 ] ] ],
        [ '燕尾蝶護腰具α', 'waist', [ 1 ], [ [ '蜂蜜獵人', 1 ], [ '收刀術', 1 ] ] ],
        [ '燕尾蝶腳α', 'leg', [ 1 ], [ [ '探索者的幸運', 1 ], [ '迴避性能', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '燕尾蝶β', 5, 'female', 80, [ -1, -1, 2, 0, 2 ], null ],
    [
        [ '燕尾蝶護頭β', 'helm', [ 1 ], [ [ '迴避性能', 2 ] ] ],
        [ '燕尾蝶上身β', 'chest', [ 1 ], [ [ '收刀術', 2 ] ] ],
        [ '燕尾蝶護袖β', 'arm', [ 2, 1 ], [ [ '植生學', 2 ] ] ],
        [ '燕尾蝶護腰具β', 'waist', [ 2, 1 ], [ [ '蜂蜜獵人', 1 ] ] ],
        [ '燕尾蝶腳β', 'leg', [ 2, 1 ], [ [ '探索者的幸運', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '獵人α', 5, 'general', 74, [ 2, 2, 0, 0, 0 ], null ],
    [
        [ '獵人頭盔α', 'helm', null, [ [ '導蟲反應距離UP', 1 ], [ '研究者', 1 ] ] ],
        [ '獵人鎧甲α', 'chest', null, [ [ '投射器裝填數UP', 2 ] ] ],
        [ '獵人腕甲α', 'arm', null, [ [ '潛伏', 2 ] ] ],
        [ '獵人腰甲α', 'waist', null, [ [ '採集達人', 1 ], [ '潛伏', 1 ] ] ],
        [ '獵人護腿α', 'leg', null, [ [ '追蹤達人', 1 ], [ '投射器裝填數UP', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '獵人β', 5, 'general', 74, [ 2, 2, 0, 0, 0 ], null ],
    [
        [ '獵人頭盔β', 'helm', [ 1 ], [ [ '導蟲反應距離UP', 1 ] ] ],
        [ '獵人鎧甲β', 'chest', [ 1 ], [ [ '投射器裝填數UP', 1 ] ] ],
        [ '獵人腕甲β', 'arm', [ 1 ], [ [ '潛伏', 1 ] ] ],
        [ '獵人腰甲β', 'waist', [ 1 ], [ [ '採集達人', 1 ] ] ],
        [ '獵人護腿β', 'leg', [ 1 ], [ [ '追蹤達人', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '毒妖鳥α', 5, 'general', 80, [ 0, 3, -3, 0, 1 ], null ],
    [
        [ '毒妖鳥頭盔α', 'helm', null, [ [ '綿花孢子草的知識', 2 ] ] ],
        [ '毒妖鳥鎧甲α', 'chest', null, [ [ '道具使用強化', 1 ], [ '植生學', 1 ] ] ],
        [ '毒妖鳥腕甲α', 'arm', null, [ [ '毒耐性', 2 ], [ '毒屬性強化', 1 ] ] ],
        [ '毒妖鳥腰甲α', 'waist', null, [ [ '毒屬性強化', 2 ] ] ],
        [ '毒妖鳥護腿α', 'leg', null, [ [ '植生學', 2 ], [ '綿花孢子草的知識', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '毒妖鳥β', 5, 'general', 80, [ 0, 3, -3, 0, 1 ], null ],
    [
        [ '毒妖鳥頭盔β', 'helm', [ 1, 1 ], [ [ '綿花孢子草的知識', 1 ] ] ],
        [ '毒妖鳥鎧甲β', 'chest', [ 1 ], [ [ '道具使用強化', 1 ] ] ],
        [ '毒妖鳥腕甲β', 'arm', [ 1, 1 ], [ [ '毒耐性', 1 ] ] ],
        [ '毒妖鳥腰甲β', 'waist', [ 1 ], [ [ '毒屬性強化', 1 ] ] ],
        [ '毒妖鳥護腿β', 'leg', [ 2 ], [ [ '植生學', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '骨製α', 5, 'general', 74, [ 2, 0, 2, 0, 2 ], null ],
    [
        [ '骨製頭盔α', 'helm', null, [ [ '體力增強', 1 ], [ '昆蟲標本達人', 1 ] ] ],
        [ '骨製鎧甲α', 'chest', null, [ [ '攻擊', 2 ] ] ],
        [ '骨製腕甲α', 'arm', null, [ [ 'KO術', 1 ], [ '攻擊', 1 ] ] ],
        [ '骨製腰甲α', 'waist', null, [ [ '吹笛名人', 1 ], [ '釣魚名人', 1 ] ] ],
        [ '骨製護腿α', 'leg', null, [ [ '昆蟲標本達人', 2 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '骨製β', 5, 'general', 74, [ 2, 0, 2, 0, 2 ], null ],
    [
        [ '骨製頭盔β', 'helm', [ 1 ], [ [ '體力增強', 1 ] ] ],
        [ '骨製鎧甲β', 'chest', [ 1 ], [ [ '攻擊', 1 ] ] ],
        [ '骨製腕甲β', 'arm', [ 1 ], [ [ 'KO術', 1 ] ] ],
        [ '骨製腰甲β', 'waist', [ 1 ], [ [ '吹笛名人', 1 ] ] ],
        [ '骨製護腿β', 'leg', [ 1 ], [ [ '昆蟲標本達人', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '土砂龍α', 5, 'general', 80, [ -3, -1, 3, -1, 0 ], null ],
    [
        [ '土砂龍頭盔α', 'helm', null, [ [ '防禦性能', 2 ] ] ],
        [ '土砂龍鎧甲α', 'chest', null, [ [ '奪取耐力', 2 ] ] ],
        [ '土砂龍腕甲α', 'arm', null, [ [ '跑者', 1 ], [ '奪取耐力', 1 ] ] ],
        [ '土砂龍腰甲α', 'waist', null, [ [ '泥耐性', 1 ], [ '防禦性能', 1 ] ] ],
        [ '土砂龍護腿α', 'leg', null, [ [ '昏厥耐性', 2 ], [ '跑者', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '土砂龍β', 5, 'general', 80, [ -3, -1, 3, -1, 0 ], null ],
    [
        [ '土砂龍頭盔β', 'helm', [ 1 ], [ [ '防禦性能', 1 ] ] ],
        [ '土砂龍鎧甲β', 'chest', [ 1 ], [ [ '奪取耐力', 1 ] ] ],
        [ '土砂龍腕甲β', 'arm', [ 1 ], [ [ '跑者', 1 ] ] ],
        [ '土砂龍腰甲β', 'waist', [ 2 ], [ [ '泥耐性', 1 ] ] ],
        [ '土砂龍護腿β', 'leg', [ 1, 1 ], [ [ '昏厥耐性', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '菌豬頭套', 5, 'general', 78, [ 2, 2, 2, 2, 2 ], null ],
    [
        [ '菌豬頭套頭', 'helm', null, [ [ '最愛菇類', 2 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '巨蜂α', 5, 'general', 76, [ -2, 1, 1, 1, 2 ], null ],
    [
        [ '巨蜂頭盔α', 'helm', null, [ [ '收刀術', 1 ], [ '麻痺屬性強化', 1 ] ] ],
        [ '巨蜂鎧甲α', 'chest', null, [ [ '風壓耐性', 2 ] ] ],
        [ '巨蜂腕甲α', 'arm', null, [ [ '麻痺屬性強化', 2 ] ] ],
        [ '巨蜂腰甲α', 'waist', null, [ [ '麻痺耐性', 2 ] ] ],
        [ '巨蜂護腿α', 'leg', null, [ [ '蜂蜜獵人', 1 ], [ '麻痺耐性', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '巨蜂β', 5, 'general', 76, [ -2, 1, 1, 1, 2 ], null ],
    [
        [ '巨蜂頭盔β', 'helm', [ 1 ], [ [ '收刀術', 1 ] ] ],
        [ '巨蜂鎧甲β', 'chest', [ 1 ], [ [ '風壓耐性', 1 ] ] ],
        [ '巨蜂腕甲β', 'arm', [ 1 ], [ [ '麻痺屬性強化', 1 ] ] ],
        [ '巨蜂腰甲β', 'waist', [ 1 ], [ [ '麻痺耐性', 1 ] ] ],
        [ '巨蜂護腿β', 'leg', [ 1 ], [ [ '蜂蜜獵人', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '雌火龍α', 5, 'general', 84, [ 2, 0, -2, 0, -3 ], null ],
    [
        [ '雌火龍頭盔α', 'helm', null, [ [ '體力增強', 2 ], [ '毒屬性強化', 1 ] ] ],
        [ '雌火龍鎧甲α', 'chest', null, [ [ '植生學', 2 ], [ '體力回復量UP', 1 ] ] ],
        [ '雌火龍腕甲α', 'arm', null, [ [ '毒屬性強化', 2 ] ] ],
        [ '雌火龍腰甲α', 'waist', null, [ [ '毒耐性', 2 ], [ '體力增強', 1 ] ] ],
        [ '雌火龍護腿α', 'leg', null, [ [ '體力回復量UP', 2 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '雌火龍β', 5, 'general', 84, [ 2, 0, -2, 0, -3 ], null ],
    [
        [ '雌火龍頭盔β', 'helm', [ 1 ], [ [ '體力增強', 1 ], [ '毒屬性強化', 1 ] ] ],
        [ '雌火龍鎧甲β', 'chest', [ 1 ], [ [ '植生學', 1 ], [ '體力回復量UP', 1 ] ] ],
        [ '雌火龍腕甲β', 'arm', [ 1 ], [ [ '毒屬性強化', 1 ] ] ],
        [ '雌火龍腰甲β', 'waist', [ 1 ], [ [ '毒耐性', 1 ], [ '體力增強', 1 ] ] ],
        [ '雌火龍護腿β', 'leg', [ 1 ], [ [ '體力回復量UP', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '皮製α', 5, 'general', 70, [ 2, 0, 0, 0, 0 ], null ],
    [
        [ '皮製頭飾α', 'helm', null, [ [ '飢餓耐性', 2 ] ] ],
        [ '皮製服飾α', 'chest', null, [ [ '火耐性', 1 ] ] ],
        [ '皮製手套α', 'chest', null, [ [ '回復速度', 1 ] ] ],
        [ '皮製皮帶α', 'chest', null, [ [ '耐力急速回復', 1 ] ] ],
        [ '皮製長褲α', 'chest', null, [ [ '攀岩者', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '皮製β', 5, 'general', 70, [ 2, 0, 0, 0, 0 ], null ],
    [
        [ '皮製頭飾β', 'helm', [ 1 ], [ [ '飢餓耐性', 1 ] ] ],
        [ '皮製服飾β', 'chest', [ 1 ], null ],
        [ '皮製手套β', 'chest', [ 1 ], null ],
        [ '皮製皮帶β', 'chest', [ 1 ], null ],
        [ '皮製長褲β', 'chest', [ 1 ], null ]
    ]
));

armors = armors.concat(combine(
    [ '岩賊龍α', 5, 'general', 86, [ 2, 0, -3, 0, 2 ], null ],
    [
        [ '岩賊龍頭盔α', 'helm', null, [ [ '爆破異常狀態的耐性', 2 ] ] ],
        [ '岩賊龍鎧甲α', 'chest', null, [ [ '爆破屬性強化', 2 ] ] ],
        [ '岩賊龍腕甲α', 'arm', null, [ [ '炸彈客', 2 ] ] ],
        [ '岩賊龍腰甲α', 'waist', null, [ [ '砲術', 2 ], [ '爆破異常狀態的耐性', 1 ] ] ],
        [ '岩賊龍護腿α', 'leg', null, [ [ '砲彈裝填數UP', 1 ], [ '爆破屬性強化', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '岩賊龍β', 5, 'general', 86, [ 2, 0, -3, 0, 2 ], null ],
    [
        [ '岩賊龍頭盔β', 'helm', [ 1 ], [ [ '爆破異常狀態的耐性', 1 ] ] ],
        [ '岩賊龍鎧甲β', 'chest', [ 1 ], [ [ '爆破屬性強化', 1 ] ] ],
        [ '岩賊龍腕甲β', 'arm', [ 1 ], [ [ '炸彈客', 1 ] ] ],
        [ '岩賊龍腰甲β', 'waist', [ 1 ], [ [ '砲術', 2 ] ] ],
        [ '岩賊龍護腿β', 'leg', [ 1 ], [ [ '砲彈裝填數UP', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '酸翼龍斗篷α', 5, 'general', 86, [ 1, 1, 0, 1, -2 ], null ],
    [
        [ '酸翼龍斗篷α', 'chest', null, [ [ '熱傷害無效', 1 ], [ '防御力DOWN耐性', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '酸翼龍斗篷β', 5, 'general', 86, [ 1, 1, 0, 1, -2 ], null ],
    [
        [ '酸翼龍斗篷β', 'chest', [ 1 ], [ [ '熱傷害無效', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '突擊龍α', 5, 'general', 86, [ 3, 0, 0, 0, 0 ], null ],
    [
        [ '突擊龍角α', 'helm', null, [ [ '減輕膽怯', 1 ], [ '爆破異常狀態的耐性', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '突擊龍β', 5, 'general', 86, [ 3, 0, 0, 0, 0 ], null ],
    [
        [ '突擊龍角β', 'helm', [ 1 ], [ [ '減輕膽怯', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '封印的眼帶α', 5, 'general', 84, [ 3, 2, 0, 2, 0 ], null ],
    [
        [ '封印的眼帶α', 'helm', [ 2, 1 ], [ [ '火耐性', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '墨鏡α', 5, 'general', 84, [ 4, 0, 4, 2, 0 ], null ],
    [
        [ '墨鏡α', 'helm', [ 1, 1, 1 ], [ [ '昏厥耐性', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '扒手龍頭套α', 5, 'general', 46, [ 2, 0, 2, 3, 2 ], null ],
    [
        [ '扒手龍頭套α', 'helm', [ 3, 1 ], [ [ '搬運達人', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '孑孓α', 5, 'general', 84, [ 0, 4, 0, 0, 4 ], null ],
    [
        [ '孑孓頭α', 'helm', [ 1, 1 ], [ [ '廣域化', 2 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '巴魯特α', 5, 'general', 78, [ 1, 1, 4, 1, 1 ], null ],
    [
        [ '巴魯特頭飾α', 'helm', [ 1, 1 ], [ [ '蜂蜜獵人', 1 ] ] ],
        [ '巴魯特服飾α', 'chest', [ 1, 1 ], [ [ '收刀術', 1 ] ] ],
        [ '巴魯特腕甲α', 'arm', [ 1, 1 ], [ [ '麻痺耐性', 1 ] ] ],
        [ '巴魯特腰甲α', 'waist', [ 1, 1 ], [ [ '導蟲反應距離UP', 1 ] ] ],
        [ '巴魯特護腿α', 'leg', [ 1, 1 ], [ [ '回復速度', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '潛水夫α', 5, 'general', 84, [ 1, 4, 1, 1, 1 ], null ],
    [
        [ '潛水夫修羅α', 'helm', [ 2 ], [ [ '跑者', 1 ] ] ],
        [ '潛水夫服裝α', 'chest', [ 2 ], [ [ '看破', 1 ] ] ],
        [ '潛水夫腕甲α', 'arm', [ 2 ], [ [ '收刀術', 1 ] ] ],
        [ '潛水夫皮帶α', 'waist', [ 2 ], [ [ '適應水場', 1 ] ] ],
        [ '潛水夫靴α', 'leg', [ 2 ], [ [ '飢餓耐性', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '獨角仙后α', 5, 'female', 80, [ -1, -1, 2, 0, 2 ], null ],
    [
        [ '獨角仙后護頭α', 'helm', [ 1 ], [ [ '昏厥耐性', 2 ], [ '防禦', 1 ] ] ],
        [ '獨角仙后上身α', 'chest', null, [ [ '體力增強', 2 ], [ '昏厥耐性', 1 ] ] ],
        [ '獨角仙后護袖α', 'arm', null, [ [ '看破', 2 ], [ '體力增強', 1 ] ] ],
        [ '獨角仙后護腰具α', 'waist', [ 1 ], [ [ '防禦', 2 ], [ '跑者', 1 ] ] ],
        [ '獨角仙后腳α', 'leg', null, [ [ '跑者', 2 ], [ '看破', 1 ] ] ]
    ]
));

armors = armors.concat(combine(
    [ '獨角仙后β', 5, 'female', 80, [ -1, -1, 2, 0, 2 ], null ],
    [
        [ '獨角仙后護頭β', 'helm', [ 2 ], [ [ '昏厥耐性', 2 ] ] ],
        [ '獨角仙后上身β', 'chest', [ 1 ], [ [ '體力增強', 1 ] ] ],
        [ '獨角仙后護袖β', 'arm', [ 1 ], [ [ '看破', 2 ] ] ],
        [ '獨角仙后護腰具β', 'waist', [ 3 ], [ [ '防禦', 2 ] ] ],
        [ '獨角仙后腳β', 'leg', [ 1 ], [ [ '跑者', 2 ] ] ]
    ]
));

export default armors;
