'use strict';
/**
 * Dataset Jewels
 *
 * @package     MHW Calculator
 * @author      Scar Wu
 * @copyright   Copyright (c) Scar Wu (http://scar.tw)
 * @link        https://github.com/scarwu/MHWCalculator
 */

export default [
    [ 'KO護石 III', null, [ [ 'KO術', 3 ] ] ],
    [ '體術護石 III', 7, [ [ '體術', 3 ] ] ],
    [ '體力護石 III', null, [ [ '體力增強', 3 ] ] ],
    [ '小胃口護石', 3, [ [ '滿足感', 1 ] ] ],
    [ '火焰護石 III', null, [ [ '火屬性攻擊強化', 3 ] ] ],
    [ '心靜自然涼護石', 7, [ [ '熱傷害無效', 1 ], [ '適應瘴氣環境', 1 ] ] ],
    [ '不屈護石', 3, [ [ '不屈', 1 ] ] ],
    [ '友愛護石 III', null, [ [ '廣域化', 3 ] ] ],
    [ '加護護石 III', null, [ [ '精靈加護', 3 ] ] ],
    [ '全開護石 II', null, [ [ '力量解放', 2 ] ] ],
    [ '早氣護石 II', null, [ [ '耐力急速回復', 2 ] ] ],
    [ '早復護石 III', null, [ [ '回復速度', 3 ] ] ],
    [ '匠之護石 III', 8, [ [ '匠', 3 ] ] ],
    [ '地學護石 III', null, [ [ '地質學', 3 ] ] ],
    [ '冰結護石 III', null, [ [ '冰屬性攻擊強化', 3 ] ] ],
    [ '耳塞護石 III', 8, [ [ '耳塞', 3 ] ] ],
    [ '攻擊護石 III', 7, [ [ '攻擊', 3 ] ] ],
    [ '快吃護石 III', null, [ [ '快吃', 3 ] ] ],
    [ '投石護石 III', null, [ [ '投射器裝填數UP', 3 ] ] ],
    [ '吹笛護石', 3, [ [ '吹笛名人', 1 ] ] ],
    [ '防禦護石 III', 6, [ [ '防禦', 3 ] ] ],
    [ '防風護石 III', null, [ [ '風壓耐性', 3 ] ] ],
    [ '昆蟲學護石 III', null, [ [ '昆蟲標本達人', 3 ] ] ],
    [ '昂揚護石 II', null, [ [ '強化持續', 2 ] ] ],
    [ '底力護石 II', null, [ [ '火場怪力', 2 ] ] ],
    [ '治癒護石 III', null, [ [ '體力回復量UP', 3 ] ] ],
    [ '泥浴護石', 5, [ [ '泥耐性', 1 ], [ '飛身躍入', 1 ] ] ],
    [ '沼渡護石 III', null, [ [ '適應水場', 3 ] ] ],
    [ '拔刀護石 II', null, [ [ '拔刀術【技】', 2 ] ] ],
    [ '威嚇護石 III', null, [ [ '威嚇', 3 ] ] ],
    [ '研磨護石 III', null, [ [ '砥石使用高速化', 3 ] ] ],
    [ '指揮護石 III', null, [ [ '指示隨從', 3 ] ] ],
    [ '持續護石 III', null, [ [ '道具使用強化', 3 ] ] ],
    [ '狩獵生活護石', 5, [ [ '烤肉名人', 1 ], [ '釣魚名人', 1 ] ] ],
    [ '重擊護石 II', null, [ [ '破壞王', 2 ] ] ],
    [ '耐瘴護石 III', null, [ [ '瘴氣耐性', 3 ] ] ],
    [ '耐火護石 III', null, [ [ '火耐性', 3 ] ] ],
    [ '耐衝護石 II', null, [ [ '減輕膽怯', 2 ] ] ],
    [ '耐震護石 II', null, [ [ '耐震', 2 ] ] ],
    [ '耐水護石 III', null, [ [ '水耐性', 3 ] ] ],
    [ '耐絕護石 III', null, [ [ '昏厥耐性', 3 ] ] ],
    [ '耐屬護石 III', null, [ [ '屬性異常狀態耐性', 3 ] ] ],
    [ '耐毒護石 III', null, [ [ '毒耐性', 3 ] ] ],
    [ '耐爆護石 III', null, [ [ '爆破異常狀態的耐性', 3 ] ] ],
    [ '耐冰護石 III', null, [ [ '冰耐性', 3 ] ] ],
    [ '耐防護石 III', null, [ [ '防御力DOWN耐性', 3 ] ] ],
    [ '耐眠護石 III', null, [ [ '睡眠耐性', 3 ] ] ],
    [ '耐雷護石 III', null, [ [ '雷耐性', 3 ] ] ],
    [ '耐龍護石 III', null, [ [ '龍耐性', 3 ] ] ],
    [ '耐裂護石 III', null, [ [ '裂傷耐性', 3 ] ] ],
    [ '耐痺護石 III', null, [ [ '麻痺耐性', 3 ] ] ],
    [ '挑戰護石 II', null, [ [ '挑戰者', 2 ] ] ],
    [ '毒擊護石 III', null, [ [ '毒屬性強化', 3 ] ] ],
    [ '毒瓶護石', 8, [ [ '毒瓶追加', 1 ] ] ],
    [ '風水護石', 8, [ [ '探索者的幸運', 1 ], [ '察覺', 1 ] ] ],
    [ '流水護石 III', null, [ [ '水屬性攻擊強化', 3 ] ] ],
    [ '順風護石', 3, [ [ '攻擊', 1 ], [ '精靈加護', 1 ] ] ],
    [ '迴避護石 III', null, [ [ '迴避性能', 3 ] ] ],
    [ '疾風護石', 8, [ [ '滑走強化', 1 ], [ '飛燕', 1 ] ] ],
    [ '追踨護石', 3, [ [ '追蹤達人', 1 ] ] ],
    [ '特射護石 II', null, [ [ '特殊射擊強化', 2 ] ] ],
    [ '納刀護石 III', null, [ [ '收刀術', 3 ] ] ],
    [ '破龍護石 III', null, [ [ '龍屬性攻擊強化', 3 ] ] ],
    [ '砲擊手護石 II', null, [ [ '砲擊手', 2 ] ] ],
    [ '砲術護石 III', null, [ [ '砲術', 3 ] ] ],
    [ '貫通彈護石', 8, [ [ '貫通彈・龍之箭強化', 1 ] ] ],
    [ '強走護石 II', null, [ [ '跑者', 2 ] ] ],
    [ '堅守護石', 8, [ [ '防禦強化', 1 ], [ '死裡逃生', 1 ] ] ],
    [ '採集鐵人護石', 5, [ [ '採集達人', 1 ], [ '剝取鐵人', 1 ] ] ],
    [ '陷阱彈護石', 5, [ [ '異臭名人', 1 ], [ '閃光強化', 1 ] ] ],
    [ '通常彈護石', 7, [ [ '通常彈・通常箭強化', 1 ] ] ],
    [ '麻痺瓶護石', 8, [ [ '麻痺瓶追加', 1 ] ] ],
    [ '渾身護石 II', null, [ [ '精神抖擻', 2 ] ] ],
    [ '散彈護石', 8, [ [ '散彈・剛射強化', 1 ] ] ],
    [ '集中護石 II', null, [ [ '集中', 2 ] ] ],
    [ '植學護石 III', null, [ [ '植生學', 3 ] ] ],
    [ '超心護石', 8, [ [ '超會心', 1 ] ] ],
    [ '痛擊護石 II', null, [ [ '弱點特效', 2 ] ] ],
    [ '無傷護石 II', null, [ [ '無傷', 2 ] ] ],
    [ '煙復護石 III', null, [ [ '綿花孢子草的知識', 3 ] ] ],
    [ '滅龍護石', 8, [ [ '龍封力強化', 1 ], [ '龍屬性攻擊強化', 1 ] ] ],
    [ '嗜菇護石 II', null, [ [ '最愛菇類', 2 ] ] ],
    [ '裝備護石 III', null, [ [ '整備', 3 ] ] ],
    [ '裝填護石', 3, [ [ '砲彈裝填數UP', 1 ] ] ],
    [ '達人護石 III', null, [ [ '看破', 3 ] ] ],
    [ '跳躍護石 II', null, [ [ '迴避距離UP', 2 ] ] ],
    [ '痺擊護石 III', null, [ [ '麻痺屬性強化', 3 ] ] ],
    [ '雷光護石 III', null, [ [ '雷屬性攻擊強化', 3 ] ] ],
    [ '睡擊護石 III', null, [ [ '睡眠屬性強化', 3 ] ] ],
    [ '睡眠瓶護石', 8, [ [ '睡眠瓶追加', 1 ] ] ],
    [ '奪氣護石 III', null, [ [ '奪取耐力', 3 ] ] ],
    [ '暴怒護石 II', null, [ [ '怨恨', 2 ] ] ],
    [ '潛伏護石 III', null, [ [ '潛伏', 3 ] ] ],
    [ '調查達人護石', 7, [ [ '導蟲反應距離UP', 1 ], [ '研究者', 1 ] ] ],
    [ '騎手護石', 7, [ [ '騎乘名人', 1 ], [ '跳躍鐵人', 1 ] ] ],
    [ '斷食護石 III', null, [ [ '飢餓耐性', 3 ] ] ],
    [ '爆師護石 III', null, [ [ '炸彈客', 3 ] ] ],
    [ '爆破護石 III', null, [ [ '爆破屬性強化', 3 ] ] ],
    [ '爆破瓶護石', 8, [ [ '爆破瓶追加', 1 ] ] ],
    [ '覺醒護石 II', null, [ [ '屬性解放／裝填擴充', 2 ] ] ],
    [ '籌備護石', 5, [ [ '搬運達人', 1 ], [ '蜂蜜獵人', 1 ] ] ],
    [ '鐵壁護石 III', null, [ [ '防禦性能', 3 ] ] ]
].map((charm) => {

    // Format
    // [
    //     0: name,
    //     1: rare,
    //     2: skills [
    //         [
    //             0: name,
    //             1: level
    //         ],
    //         [ ... ]
    //     ]
    // ]
    return {
        name: charm[0],
        rare: charm[1],
        skills: charm[2].map((skill) => {
            return {
                name: skill[0],
                level: skill[1]
            };
        })
    };
});
