'use strict';
/**
 * Dataset Sets
 *
 * @package     MHW Calculator
 * @author      Scar Wu
 * @copyright   Copyright (c) Scar Wu (http://scar.tw)
 * @link        https://github.com/scarwu/MHWCalculator
 */

export default [
    [ '蠻顎龍之力', [ [ '振奮', 3 ] ] ],
    [ '慘爪龍之力', [ [ '拔刀術【力】', 3 ] ] ],
    [ '風漂龍的恩惠', [ [ '幸運', 3 ] ] ],
    [ '幻獸的恩惠', [ [ '捕獲名人', 4 ] ] ],
    [ '角龍之力', [ [ '鈍器能手', 3 ] ] ],
    [ '火龍之力', [ [ '會心攻擊【屬性】', 3 ] ] ],
    [ '蠻顎龍的鬥志', [ [ '振奮', 2 ], [ '突破耐力上限', 4 ] ] ],
    [ '熔山龍的奧秘', [ [ '會心攻擊【特殊】', 3 ] ] ],
    [ '櫻火龍的奧秘', [ [ '毒傷害強化', 3 ] ] ],
    [ '風漂龍的恩竉', [ [ '幸運', 2 ], [ '解放弓的蓄力階段', 4 ] ] ],
    [ '角龍之奧秘', [ [ '鈍器能手', 2 ], [ '無屬性強化', 4 ] ] ],
    [ '慘爪龍的奧秘', [ [ '拔刀術【力】', 2 ], [ '剛刃研磨', 4 ] ] ],
    [ '火龍奧秘', [ [ '會心攻擊【屬性】', 2 ], [ '心眼／彈導強化', 4 ] ] ],
    [ '爆鎚龍的守護', [ [ '防禦強化', 3 ] ] ],
    [ '爆鱗龍的守護', [ [ '毅力', 3 ] ] ],
    [ '屍套龍的命脈', [ [ '超回復力', 3 ] ] ],
    [ '滅盡龍的飢餓', [ [ '加速再生', 3 ] ] ],
    [ '炎王龍的武技', [ [ '達人藝', 3 ] ] ],
    [ '鋼龍的飛翅', [ [ '風壓完全無效', 3 ] ] ],
    [ '冥燈龍的神秘', [ [ '利刃／彈藥節約', 3 ] ] ],
    [ '麒麟的恩寵', [ [ '捕獲名人', 3 ] ] ],
    [ '公會的引導', [ [ '強運', 4 ] ] ],
    [ '調查團的引導', [ [ '剝取名人', 4 ] ] ],
    [ '炎妃龍的恩寵', [ [ '突破耐力上限', 2 ], [ '心眼／彈導強化', 4 ] ] ],
    [ '龍騎士之證', [ [ '飛燕【屬性】', 2 ], [ '達人藝', 4 ] ] ]
].map((set) => {

    // Format
    // [
    //     0: name,
    //     1: skills [
    //         [
    //             0: name,
    //             1: require
    //         ],
    //         [ ... ]
    //     ]
    // ]
    return {
        name: set[0],
        skills: set[1].map((skill) => {
            return {
                name: skill[0],
                require: skill[1]
            };
        })
    };
});
